[{"id": 25001, "Department": "Climate Studies", "Code": "CMS801", "Title": "Seminar", "TotalCredits": "4", "Description": "x", "Prerequisite": null, "TextReference": "x", "LastUpdate": "09-01-2012", "Structure": {"Type": "S", "Lecture": "0", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 26001, "Department": "Educational Technology", "Code": "ET 611", "Title": "Learning Sciences", "TotalCredits": "6", "Description": "1) Learning as a science2) Contemporary theories of learning such as cognitive apprenticeship, situated learning, productive failure3) Case based reasoning, project based learning and problem based learning4) Scaffolding and metacognition5) Formative assessment6) Conceptual change7) New trends in technology-enhanced learning such as tangible, full body and embodied interfaces, video games and virtual worlds8) Computer supported collaborative learning, including knowledge building, argumentation 9) Mobile and seamless learning", "Prerequisite": null, "TextReference": "1) The Cambridge handbook of the learning sciences. Sawyer, R. K. (Ed.). (2014).302240New York, NY: Cambridge University Press (2nd ed). 2) How people learn: Brain, mind, experience, and school (expanded edition). National Research Council (2001). Washington, DC: National Academy Press. 3) Online resources including videos by experts in the field at NAPLES - Network of Academic Programs in the Learning Sciences (hosted by the International Society of the Learning Sciences.) http://isls-naples.psy.lmu.de", "LastUpdate": "16-01-2019", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 26002, "Department": "Educational Technology", "Code": "ET 614", "Title": "Instructional Systems Design", "TotalCredits": "6", "Description": " What is instructional systems design? Why is it required? What do instructional designers do?  Learning theories and how they inform instructional systems design  Basic processes of instructional design; Needs assessment and instructional goals  Learning objectives, Taxonomies of cognitive levels  Assessment: Diagnostic, Formative, Summative  Effective teaching-learning strategies  Technology-enhanced learning environments  Models of instructional design  Evaluation of instructional systems", "Prerequisite": null, "TextReference": " Instructional-Design Theories & Models: The Learner-Centered Paradigm of Education. Charles Reigeluth, Brian J. Beatty & Rodney D. Myers (Editors). Routledge.  M. D. Roblyer. Introduction to Systematic Instructional Design for Traditional, Online, and Blended Environments. NJ: Pearson. 2015.", "LastUpdate": "16-01-2019", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 27001, "Department": "Industrial Engineering and Operations Research", "Code": "IE 613", "Title": "Online Learning", "TotalCredits": "6", "Description": "1. Brief introduction to batch learning methods and algorithms 2.Introduction to online learning methods: adversarial and stochastic settings 3.Convex optimization methods for online learning algorithms 4.Online learning with expert feedback, bandit feedback, partial monitoring: algorithms and their analysis 5.Online learning with side information (known and unknown feedback structure)", "Prerequisite": null, "TextReference": "1) T. Hastie, R. Tibshirani and J. Friedman, Elements of Statistical Machine Learning\", Springer Series in Statistics, 2009. 2) S. Shalev-Shwartz and S. Ben-David, Understanding Machine Learning: From The- ory to Algorithms\", Cambridge University Press, 2014. 3) S. Shalev-Shwartz, Online Learning and Online Convex Optimization\", NOW Pub- lishers, 2012. 4) S. Bubeck and N. Cesa-Bianchi, Regret Analysis of Stochastic and Non-Stochastic Multi-armed Bandit Problems\", NOW Publishers, 2012. 5) N. Cesa-Bianchi and G. Lugosi, Prediction, Learning, and Games\", Cambridge Uni- versity Press, 2006.", "LastUpdate": "08-12-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 27002, "Department": "Industrial Engineering and Operations Research", "Code": "IE 614", "Title": "Linear Systems", "TotalCredits": "6", "Description": "Revised Syllabus: Aim of course: To familiarize students with models and theory of linear dynamical systems. Major Contents: ● Review of linear algebra: Systems of linear equations, Gaussian elimination, inverse of matrix and transpose. ● Review of Fields, Vector Spaces and Linear Transformations. Review of concepts of linear independence, basis, and fundamental subspaces associated with matrices and linear transformations, rank-nullity theorem, duality. ● Eigenvalues and eigenvectors of matrices and linear transformations, characteristic polynomials, Cayley-Hamilton Theorem, diagonalization. ● Concepts of dynamic systems and linear time invariant systems. Representation of linear dynamical systems using ordinary differential equations (ODEs) and linearization of non-linear dynamical systems. ● Solution methods of first order, second order and higher order ODEs and systems of ODEs. ● Solution methods of difference equations, existence and uniqueness theorems, Laplace and z-transforms. ● Transfer functions, concepts of stability, controllability and observability, canonical forms-Diagonal and Jordan forms. ● Applications, examples and case-studies involving simple linear systems.", "Prerequisite": null, "TextReference": "● Chi-Tsong Chen (1998) Linear System Theory and Design, 3rd edition, Oxford University Press. ● Morris W. Hirsch, Robert L. Devaney and Stephen Smale (2004) Differential Equations, Dynamical Systems, and an Introduction to Chaos, 2nd edition, Academic Press. ● Jack Leonard Goldberg, Matthew Boelkins, and Merle Potter . Differential Equations with Linear Algebra, 1 st Edition (2009), Oxford University Press. ● Ferenc Szidarovszky and Terry Bahill (1997) Linear Systems Theory, 2nd edition, CRC Press. ● Robert L. Williams III and Douglas A. Lawrence (2007) Linear State-Space Control Systems, John Wiley & Sons", "LastUpdate": "12-07-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 27003, "Department": "Industrial Engineering and Operations Research", "Code": "IE 616", "Title": "Decision Analysis and Game Theory", "TotalCredits": "6", "Description": "Decision making techniques for systems operating under uncertainty. Multi criteria decision models, Pareto optimality, Goal programming with examples. Basic concepts of decision theory. Decision under risk with examples: Probability and Bayesian Inference, von-Neumann Morgenstern expected utility theorem, Interpretations of probability; Utility, paradoxes of utility theory, Newcomb`s problem. Dynamic programming, finite state action models, backward induction algorithm, and applications. Multi-agent models and Game Theory, with applications: Prisoner`s Dilemma, zero-sum and non-zero-sum games, static and dynamic games, strategic and extensive form games, Nash Equilibrium, Backward induction, repeated games, games with incomplete information, Bayesian Nash equilibrium, Evolutionary game theory.", "Prerequisite": null, "TextReference": "Martin J. Osborne (2003) An Introduction to Game Theory, Oxford University Press. ISBN: 0195128958 EAN: 9780195128956 Robert Gibbons (1992) Game Theory for Applied Economists, Princeton University Press ISBN: 0691003955 EAN: 9780691003955 James N. Webb (2006) Game Theory: Decisions, Interaction and Evolution, Springer. ISBN: 1846284236 EAN: 9781846284236 Richard Ernest Bellman (2003) Dynamic Programming, Dover Publications. ISBN: 0486428095 EAN: 9780486428093 Dimitri P. Bertsekas (2005) Dynamic Programming & Optimal Control, 3rd edition, Athena Scientific ISBN-10: 1886529264 ISBN-13: 978-1886529267 Hamdy. A. Taha (2002) Operations Research: An Introduction, 8th edition, Prentice Hall of India. ISBN: 8120330439 Wayne L. Winston (2004) Operations Research: Applications and Algorithms, 4th edition, Thomson Learning. ISBN: 8131501906 EAN: 9788131501900 F. Hillier and G. Lieberman (2005) Introduction to Operations Research, 8th edition, McGraw-Hill ISBN-10: 0073211141 ISBN-13: 978-0073211145", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 27004, "Department": "Industrial Engineering and Operations Research", "Code": "IE 714", "Title": "Quantitative Models for Supply Chain Management", "TotalCredits": "6", "Description": "Supply chain management involves a number of decisions that benefit by quantitative techniques of analysis and design. The course will take up a few of these to explore modeling, computation and IT-enabled implementation of solutions in some areas of Supply Chain Management. The application areas include material flow management across the supply chain, value management and analysis of total supply chain costs, robust design of supply chains, co-ordination of supply chain decisions and handling of uncertainties in supply chain management. The emphasis will be on modeling, analysis and implementation issues, including a few case studies, but the relevant techniques will be covered as required.", "Prerequisite": "Y", "TextReference": "* Simchi-Levi, D. P. Kaminski and E. Simchi-Levi (2003), Designing and Managing the Supply Chain: Concepts, Strategies and Case Studies, (2nd Edition) Irwin, McGraw-Hill. * Chopra S., and P. Meindl (2002), Supply Chain Management: Strategy, Planning, and Operations, Prentice-Hall, India. * Shapiro J. (2001), Modelling the Supply Chain, Duxbury Thomson Learning * N. Viswanadham. (1999), Analysis of Manufacturing Enterprises: An approach to Leveraging Value Delivery Process for competitive Advantage, Kluwer Academic Publishers, Boston. * Tayur, S. Ram Ganeshan and Michael Magazine (1998), Quantitative Models for Supply chain Management, Kluwer Academic Publishers, Boston. * G. Raghuram and N. Rangaraj [Editors] (2000) Logistics and Supply Chain Management: Cases and Concepts, Macmillan, New Delhi. * Journal articles as appropriate", "LastUpdate": "20-03-2006", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "null", "HalfSemester": "N"}}, {"id": 27005, "Department": "Industrial Engineering and Operations Research", "Code": "IE 716", "Title": "Integer Programming: Theory and Computations", "TotalCredits": "6", "Description": "1. Effective modelling in integer programming: Modelling with integer variables: correct formulations; optimality, relaxation, bounds, search, branch-and-bound; choices in modelling: strong formulations, extended formulations, preprocessing of formulations. 2. Polyhedra and integer programming: Describing polyhedra with extreme points and extreme rays; affine independence, dimensions and faces of polyhedra; facets of polyhedra; projection of polyhedra onto subspaces; the polar of polyhedra; equivalence of separation and optimization for polyhedra; connections between polyhedra and integer programming. 3. Relaxation and decomposition methods for large{scale problems: Lagrangian relaxation and subgradient optimization; Dantzig–Wolfe decomposition and column generation; Benders decomposition. 4. Cutting plane methods for unstructured problems: Gomory and Chvátal-Gomory cuts; Integer and mixed-integer rounding; Disjunctive cuts: lift-and-project cuts, split cuts, intersection cuts; the group approach to integer programming. 5. Cutting plane methods for structured problems: Valid inequalities for set packing and 0–1 knapsack problems and their separation; clique and odd-cycle inequalities; cover inequalities; sequential and sequence-independent lifting (with examples in the context of cover inequalities); applications in airline crew scheduling, production lot-sizing, facility location, and network design.", "Prerequisite": "0", "TextReference": "1. G. L. Nemhauser and L. A. Wolsey, Integer and Combinatorial Optimization, Wiley, 1999. 2. L. A. Wolsey, Integer Programming, Wiley, 1998 3. A. Schrijver, Theory of Linear and Integer Programming, Wiley, 1998. 4. Y. Pochet and L.A. Wolsey, Production Planning by Mixed Integer Programming, Springer, 2006. 5. D. Bertsimas and R. Weismantel, Optimization over Integers, Dynamics Ideas, 2005. 6. Several journal papers that exemplify the progress of integer programming over the last two decades.", "LastUpdate": "02-01-2009", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 27006, "Department": "Industrial Engineering and Operations Research", "Code": "IES601", "Title": "Seminar", "TotalCredits": "5", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": "22-12-2009", "Structure": {"Type": "S", "Lecture": "0", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 27007, "Department": "Industrial Engineering and Operations Research", "Code": "IES801", "Title": "Seminar", "TotalCredits": "4", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": "03-04-2003", "Structure": {"Type": "S", "Lecture": "0", "Tutorial": "0", "Practical": "4", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 28001, "Department": "Systems and Control Engineering", "Code": "SC 618", "Title": "Analytical and Geometric Dynamics", "TotalCredits": "6", "Description": "Elementary Newtonian Dynamic Dynamics of systems of particles - Newton`s laws and rotational analogues, work-energy and impulse-momentum relationships, Kinematics of particles and rigid bodies, Impact problems, Changing mass problems Kinematics Reference frames - orthonormal, dextral frames, sequence of rotations, Rates of change of vectors in various frames, Coriolis acceleration and effects. Analytical Dynamics – Lagrangian/Hamiltonian formulations, Constraints, generalized coordinates, Virtual work principle, generalized forces, Extension of dynaimics (D-Alembert principles), Lagrange`s Equations, Conserved quantities and Cyclic coordinates, Generalized momenta, Hamilton/Jacobi integral, Hamilton`s equations, Routhian and Routh`s equations, Non-Holonomic Constrains, Lagrange Multipliers. Introduction to smooth manifolds and Lie groups, kinematics on the Lie groups SO(3) and SE(3), a geometric view of the rigid body motion both in a Hamiltonian and Lagrangian geometric framework, the rigid body stability and heavy top stability.", "Prerequisite": null, "TextReference": "Introduction to Robotics: Mechanics and Control - J. J. Craig, Addison Wesley, 2nd Edition, 1989. Analytical Mechanics - Joseph S. Torok, Wiley-Interscience, 1999 Principles of Dynamics - Donald T. Greenwood, Prentice-Hall, 2nd Edition, 1987 Methods of Analytical Dynamics - Leonard Meirovitch, McGraw-Hill, 1970 Geometric Mechanics and Symmetry - D .D. Holm, T. Schmah and C. Stoica, Oxford University Press, 2009. Introduction to Mechanics and Symmetry - J. Marsden and T. Ratiu, Springer-Verlag, 1994.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}]