[{"id": 29001, "Department": "Shailesh J. Mehta School of Management", "Code": "MGT801", "Title": "Introduction to Research Methods", "TotalCredits": "3", "Description": "1. The theory of knowledge: Scientific and other approaches of knowledge (authority, tenacity, logical approach, and scientific method),2. Research paradigms: Kuhn and Popper,3. Research in management: Types of research (basic/applied), nature of data, and types of variables,4. Reviewing literature, identifying research problem, and hypotheses formulation,5. Research Design (experimental and quasi-experimental),6. Developing tests/instruments (schedules),7. Sampling, Field of data collection (laboratory/field studies),8. Data collection methods: surveys, interviews, and case studies,9. Action research Analyzing data and interpreting results,10. Reflection on preparing a research report,11. Following a professional reference style.", "Prerequisite": null, "TextReference": "1. Brewer, J. D., & Hunter, A. (2005). Foundations of multi-method research. London: Sage. 2. Johnson, P., & Clark, C. (2006). Business and management research methodologies. London: Sage.Kerlinger, 3. Kuhn, T. S. (1970). The structure of scientific revolution (2nd Ed.). Chicago: University of Chicago Press. 4. Williams, M. and T. May (1996). Introduction to the Philosophy of Social Research. London, UCL Press.", "LastUpdate": "03-05-2012", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29002, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM612", "Title": "Business Research Methods", "TotalCredits": "4", "Description": "Perceptions and attribution, Attitude, values, Motivation, Understanding personality, Groups and Teams, Leadership, Organization culture and climate", "Prerequisite": null, "TextReference": "Sekaran, U, Research methods for business: A skill building approach, New Jersey, John Wiley and Sons, 4th ed., 2003. Naresh Malhotra, S Dash, Marketing Research, An Applied Orientation, Pearson Education, 6th Ed., 2010. Hair, Anderson, Tatham and Black, Multivariate Data Analysis, Pearson Education. Andy P. Field, Discovering Statistics using SPSS, SAGE, 5th Ed, 2000. Kerlinger F. N. and Lee. H.B., Foundations of Behavioral Research, Harcourt College Publishers, 4 th Edition, 2000. William G. Zikmund, Barry J. Babin, Jon C. Carr, Mitch Griffin, Business Research Methods, Cengage Learning, 7 th Edition, 2009. Business Research Methods, Author - Zikmund, Cengage Learning, 8th edition, 2016", "LastUpdate": "23-01-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29003, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM613", "Title": "Corporate Finance", "TotalCredits": "4", "Description": "Valuation of stocks and bonds, portfolio theory, asset pricing models, cost of capital, market efficiency, options and futures, capital structure, dividend policy, leasing, mergers and acquisitions.", "Prerequisite": null, "TextReference": "Brealey, Myers and Allen, \"Principles of Corporate Finance\", 9th Edition, McGraw- Hill. ISBN: 0073286982 Megginson, Smart, and Gitman, Principles of Corporate Finance, Cengage Learning, ISBN: 978-81-315-0487-1 I.M. Pandey, and Ramesh Bhat, Cases in Financial Management, 2nd Edition, Tata McGraw-Hill, ISBN: 9780074638057", "LastUpdate": "23-01-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29004, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM614", "Title": "Organization Behavior & Human Resources I", "TotalCredits": "4", "Description": "Perceptions and attribution, Attitude, values, Motivation, Understanding personality, Groups and Teams, Leadership, Organization culture and climate", "Prerequisite": null, "TextReference": "Robbins, Stephen P., Judge, Timothy A. & Sanghi, S.; Organizational Behavior. 12th ed. Pearson Education, 2009 Stephen P., Judge, Timothy A. & Sanghi, S.; 2007. Organizational Behavior. 12th ed. Prentice Hall of India. Organizational Behavior, Author - Robbins, Pearson, 16th edition, 2016", "LastUpdate": "08-02-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29005, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM615", "Title": "Operations Management II", "TotalCredits": "4", "Description": "Operations Planning and Control Systems for Discrete and Continuous Manufacturing. Demand Forecasting; Inventory Management of Independent Demand Items; Manufacturing Resources Planning (MRP II): Sales and Operations Planning. Master Production Scheduling, Materials Requirement Planning (MRP), Production Activity Control Systems, Personnel Scheduling Systems; Just-in-Time and Theory of Constraints", "Prerequisite": null, "TextReference": "R. Chase, R. Shankar, F. Jacobs, N. Aquilano, Operations And Supply Management, 12 th edition, McGraw Hill, 2010 L. J. Krajewski and L.P. Ritzman, Operations Management: Strategy and Analysis, 6th ed., Prentice Hall, 2003", "LastUpdate": "23-01-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29006, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM616", "Title": "Technology Management", "TotalCredits": "4", "Description": "Foundations Need, definitions of technology, innovation and management of technology (MOT) for competitiveness; Key MOT sub-processes for value creation; Integrating technology and business strategy, Strategy concept, views, process; Strategy and technology linkages for competitiveness: technological capabilities, gaps, capability building through alternate routes; Technology intelligence, audit; Formulating and implementing technology strategy Reviewing and evolving organizations strategic direction; Acquisition and exploitation of technology; Cooperative strategies: strategic alliances; Organizing for innovation: new technology / product development process, idea management system, managing teams;", "Prerequisite": null, "TextReference": "Schilling, M.A.; Strategic Management of Technological Innovation; McGraw-Hill, 2005. Key References: Burgelman R. A., Christensen C. M. and Wheelright S.C., Strategic Management of Technology and Innovation, McGraw-Hill, 2009. Khalil T. and Shankar R., Management of Technology: The Key to Competitiveness and Wealth Creation, Tata McGrawHill, New Delhi, 2012. Shane S. Technology Strategy for Managers and Entreprenures, Prentice Hall, 2008.", "LastUpdate": "23-01-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29007, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM617", "Title": "Corporate Strategy", "TotalCredits": "4", "Description": "Introduction to Corporate Strategy MODULE 1: Porter’s 5-forces approach:The firm, its environment and Industry structure Competitive advantage MODULE 2: Looking inside the firm:T ypes of Strategies: Market oriented strategic planning versus Emerging strategies T HE R ESOURCE -B ASED -V IEW MODULE 3: G ROWING THE FIRM :G ROWTH STRATEGIES , G LOBAL VERSUS LOCAL : I NTERNATIONALISATION M ERGERS AND A CQUISITIONS , S TRATEGIC A LLIANCES MODULE 4: Implementation and Governance (optional)", "Prerequisite": null, "TextReference": "Arthur A. Thompson jr., A.J. Strickland III, John E.Gamble & Arun K. Jain . Crafting and Executing Strategy – The Quest for Competitive Advantage, ; 14th edition; TATA Mc Graw Hill, 2006 Garth Saloner, Andrea Shepard, Joel Podolny , Strategic Management, ; John Wiley & Sons Inc., 2001 Robert M.Grant , Contemporary Strategic Analysis. Concepts, Techniques, Applications, ; 4th edition; Blackwell Publishers, 2002 Alex Miller , Strategic Management, ; Irwin McGraw Hill; New York, 1998 David Collins and Cynthia Montgomery ,Corporate Strategy: Resources and Scope of the Firm, ; McGraw- Hill, 1997, 1. Crafting and Executing Strategy, Author - Arthur A. Thompson Jr., Margaret A Peteraf, John E Gamble, A.J.Strickland III & Arun K Jain, Tata McGraw-Hill, 19th edition, 2016, ......2. Strategies For Growth : Help Your Business Move Up The Ladder, Author - Atanu Ghosh, Random House India, 1st edition, August 2016.", "LastUpdate": "23-01-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29008, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM618", "Title": "Organization Behavior & Human Resources II", "TotalCredits": "4", "Description": "Introduction to HRM, HR Metrics, Job Analysis, Human resource planning and recruiting, EmployeeTesting and Selection ,Training and Developing Employees, Talent management, Performance Appraisaland Management , Managing Career, Establishing Strategic Pay Plans, Pay for Performance and FinancialIncentives, Emerging themes in HRM", "Prerequisite": ".0", "TextReference": "Gary Dessler and Biju Varkey, Human Resource Management, 11 edition, Pearson,2010.W.F. Cascio and H. Aguinis, Applied Psychology in Human Resource Management,Prentice Hall India, 6th edition, 2009", "LastUpdate": "08-02-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29009, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM619", "Title": "Corporate Governance and Business Ethics", "TotalCredits": "4", "Description": "Corporate Governance: Evolution, Principles and Guidelines, Approaches and school of thoughts in ethics, Ethical issues in marketing, Human resource management, Globalization", "Prerequisite": null, "TextReference": "Corporate Governance Matters: A Closer Look at Organizational Choices and Their Consequences (2nd edition) By David F. Larcker, Brian Tayan Pearson FT Press, July 31, 2015 Business Ethics Managing Corporate Citizenship and Sustainability in the Age of Globalization Fourth Edition Andrew Crane and Dirk Matten Publication Date - September 2016 Reference Books:  G. N. Bajpai, The Essential Book of Corporate Governance, (2016) G.N.  Joseph W. Weiss Business Ethics Concepts and Cases, (2011). Cengage Delmar Learning India  Chakraborty S. K., Values & Ethics for Organisations, OUP, 1998  Kenneth Blanchard, Power of Ethical Management, Sage, 1997", "LastUpdate": "23-01-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29010, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM621", "Title": "Legal Aspects of Business", "TotalCredits": "4", "Description": "x", "Prerequisite": null, "TextReference": "Business Legislation of Management by Kuchal and Prakash, Vikas Publishing House, NOIDA, 2010. Legal Aspects of Business by Akhilesh Pathak, Tata McGraw-Hill, New Delhi, 2010 Business Legislation for Management, Author - Mr. M.C. Kuchhal, Vikas Publishing house, Fourth edition (2014)", "LastUpdate": "23-01-2019", "Structure": {"Type": "T", "Lecture": "4", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29011, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM691", "Title": "Intelligent Systems", "TotalCredits": "3", "Description": "Introduction to BI and analytics Data mining and data warehousing Web 2.0, semantic web and knowledge-management Intelligent systems: expert systems, case-based reasoning, neural networks, genetic algorithms and model-based reasoning Filtering techniques and recommender systems Intelligent agents Emerging trends", "Prerequisite": null, "TextReference": "Next Generation Business Intelligence: a knowledge-based approach by R M Sonar, First Edition, 2011, Vikas Publications (would be available soon: end of Feb 2011). Business Intelligence: a managerial approach by Efraim Turban, Ramesh Sharda, Dursun Delen and Devid King. Second Edition, Pearson Education, 2010.", "LastUpdate": "05-02-2019", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29012, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM701", "Title": "Online Marketing", "TotalCredits": "3", "Description": "Part A: Introduction 1. Digital Marketing Overview 2. Inbound Marketing vs. Traditional Outbound Marketing Part B: Get Found-Blogging 3. Search Engine Optimization 4. Social Media 5. Search Engine Marketing Part C: Lead Conversion 6. Lead Nurturing & Email Marketing Part D: Analyse -Web Analytics 7. Social Media & Blog Analytics", "Prerequisite": null, "TextReference": " Understanding Digital Marketing: Marketing Strategies for Engaging the Digital Generation Damian Ryan, Calvin Jones (2009), Publisher: Kogan Page Limited (2009)  Digital Marketing: Global Strategies from the World`s Leading Experts, Jerry Wind, Vijay Mahajan, Wiley Publication, ISBN: 978-0-471-36122-0 Brand Media Strategy: Integrated Communications Planning in the Digital Era , Antony Young (2010) Palgrave Macmillan", "LastUpdate": "29-01-2019", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29013, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM711", "Title": "Behavioural Economics", "TotalCredits": "3", "Description": "Need, Evolution,Recent Developments Critique of Rationality in Economic Decision Making;Preferences, beliefs, Prospects Theorey and Cumulative Prospect Theorey, Bounded Rationality, references-dependent UtilityApplications: Risk Aversion, Loss Aversion,Myopia Naivete,Hyperbolic Discounting,Ambiguity Aversion, Heuristics and Biases, errors in Judgement, Cognitive Dissonance, Consumer Mistakes, Pro-social Behavious, herding Behaviour, Experiments to Action Case Studies: Indian and International Settings", "Prerequisite": null, "TextReference": "BooksAkerlof,G.(2009) Animal Spirits: How Human Psychology drives the Economy, and Why it Matters for Global Capitalism (princeton University Press).Ariely,D.(2010) Predictably Irrational: The Hidden Forces That Shape Our Decisions(Harper)Kahneman,D., and Tversky,A. (1979) Prspect Theorey: An Analysis of Decision under Risk. Economentica 47(2);263-292Kahneman,D., and Tversky,A.(1982) Judgment under Uncertainity:Heuristics and Biases (cambridge University Press)Shiller,R.(2006) Irrational Exuberance 2nd Ed.(Crown Business)ArticleBenartizi,S. and R.Thaler (1995), \"Myopic loss Aversion and the equity premium puzzle\" Quarterly Journal of Economics 110:75-92Cameer,C.F., Babcock,L., Loewenstein,G, Thaler,R.(1997)\"Labour Supply of New YorkCity cab drivers:One day at a time\" Quarterly Journal of Economics 112(23):407-441Laibson,David (1997)\"Golden Eggs and Hyperbolic Discounting\" Quarterly Journal of Economics 112(2);443-478", "LastUpdate": "11-09-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29014, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM712", "Title": "Management of Digital Transformation in Enterprise", "TotalCredits": "3", "Description": "Changing scenario of business and application of digital technology Knowledge of Digital five Forces : Cloud Computing , Mobility, Analytics, social media, Robotics A brief session on each of these Digital technology areas and their business benefitsBig Data : A New paradigm of BusinessAnalytics as business strategy Concept of digital business and Case Studies What is Digital MasteryDigital as transformation agent for businessMethodology of building digital strategyROI of digitalizationExecution strategy of Digital strategy Role of Digital OfficerBusiness alignment Governance model for digital transformationSustaining Digital EnterpriseHow digital transformation is different from IT upgradationSocial organization Mass Collaboration", "Prerequisite": null, "TextReference": "1. Leading Digital : Turning Technology into business transformation By : George Westerman and Andrew McAfee Published by Harvard Business Review Press in year 20142. The Social organization : How to use social media to Tap the collective Genius of your customers and employees by Anthony J Bradley and Mark P Mc Donald , Published by Havard Business Review Press Published in year 20113. Macrowikinomics : Rebooting business and the world by Don Tapscott and Anthony D wiliams Published by Portfolio/Penguin, 2010", "LastUpdate": "11-09-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 29015, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM716", "Title": "Economics of Firm Strategy", "TotalCredits": "6", "Description": "Basic Game Theory 302226 covers non-cooperative game theory, Nash equilibrium, sub-game perfectequilibrium, normal form and extensive form gamesBasic Micro-economics 302226 cost function, production function, Returns to scale, Minimum Efficient scale,Consumer Surplus, Producer Gain, Dead weight LossDifferent market structures 302226 Perfect Competition, Monopoly for durable and non-durable goods, Duopoly, Oligopoly, Simultaneous vs Sequential decisionDiscriminant Monopoly, Cartels vs. multi-plant monopoly 302226 differences and implicationsMeasure of differentiation, non-address models 302226 Bertrand, Cournot (Simultaneous) andSequential DecisionAddress models and Locational choice 302226 Linear city and Circular CityMergers & Acquisitions 302226 Reasons and implications on Social WelfareEntry Barriers 302226 Natural and AdvancedEntry deterrent behavior 302226 investment in capacity addition, Judo strategy, Limit Pricingetc.R&D investment 302226 Socially optimal R&D, patents 302226 process and product, R&DSpillovers, Collaborative R&DAdvertising 302226 Dorfman-Steiner Condition, Socially optimal advertising, Pursuasive vs.Informative Advertising, Advertising StandardsPrincipal-agent problem 302226 devising a contract accounting for uncertainty, risk aversebehavior, Solving for Free-riding problem, Why managers are paid more?, Regulating afirm with unknown cost.", "Prerequisite": null, "TextReference": "Main Text:1) Economics of Strategy (2016) by David Dranove, Mark Shanley, David Besanko, and ScottSchaefer. WileySupplementary Texts:2) Industrial Organization: Markets and Strategies (2010), Paul Bellflamme and Martin Peitz, CambridgeUniversity Press.3) Oz Shy (1997), Industrial Organization: Theory and Application , MIT Press, (3 rdEdition) .Other readings:Ayres, Ian, \"How Cartels Punish: A Structural Theory of Self-Enforcing Collusion\" (1987). FacultyScholarship Series. Paper 1549. http://digitalcommons.law.yale.edu/fss_papers/1549Richard J. Gilbert and Michael L. Katz, An Economist`s Guide to U.S. v. Microsoft (2001), The Journal ofEconomic Perspectives, Vol. 15, No. 2 (Spring, 2001), pp. 25-44.Robert H. Porter, 302223Detecting Collusion (2005)302224 Review of Industrial Organisation, 26: 147-167.Yoshi Tsurumi, Hiroki Tsurumi, 302223Fujifilm-Kodak Duopolistic Competition in Japan and the United States302224(1999) Journal of International Business Studies, 30(4); 813-830", "LastUpdate": "11-09-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 29016, "Department": "Shailesh J. Mehta School of Management", "Code": "SOM718", "Title": "Money: Past, Present and Future", "TotalCredits": "3", "Description": "What is money? What are its functions?The desired properties and different types of moneyWhat can be and has been used as money?A linear and cyclical history of moneyTheories on the origins of moneyUnderstanding modern moneyHow central and commercial banks create moneyDigital money and cryptocurrenciesThe future of money and its possibilities.", "Prerequisite": null, "TextReference": "What is money? edited by John Smithin, Routledge. ISBN-13: 978-0415407076, 2002.302225 Debt: The first 5,000 years by David Graeber, Updated and Expanded, Melville House. ISBN-13: 978-1612194196, 2014.st302225 An anthropology of money: A critical introduction by Tim Di Muzio & Richard H. Robbins, 1 edition,Routledge. ISBN-13: 978-1138645981, 2017.10. Reference Booksst302225 The nature of money by Geoffrey Ingham, 1 edition, John Wiley & Sons. ISBN-13: 978-0745609973, 2004.302225 Credit and state theories of money by Randall Wray, Edward Elgar Publishing. ISBN-13: 978-1843765134, 2004.302225 Sapiens: A brief history of humankind by Yuval Noah Harari, Random House. ISBN-13: 978-0062316110, 2014.Journal Articles302225 Searle, J. R. (2017). Money: ontology and deception. Cambridge Journal of Economics, 41(5), 1453-1470.302225 Lawson, T. (2018). Debt as money. Cambridge Journal of Economics, 42(4), 1165-1181.302225 McLeay, M., Radia, A., & Thomas, R. (2014). Money creation in the modern economy. Bank of EnglandQuarterly Bulletin, Q1.302225 Nakamoto, S. (2008). Bitcoin: A peer-to-peer electronic cash system.302225 Weber, B. (2014). Bitcoin and the legitimacy crisis of money. Cambridge Journal of Economics, 40(1), 17-41.302225 Dodd, N. (2018). The social life of Bitcoin. Theory, culture & society, 35(3), 35-56.", "LastUpdate": "02-11-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}]