[{"id": 1001, "Department": "Aerospace Engineering", "Code": "AE 102", "Title": "Data Analysis and Interpretation", "TotalCredits": "6", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": "01-12-2015", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1002, "Department": "Aerospace Engineering", "Code": "AE 152", "Title": "Introduction to Aerospace Engg.", "TotalCredits": "6", "Description": "Nomenclature of aircraft components. Standard atmosphere. Basic Aerodynamics : Streamlines, steady fluid motion, incompressible flow, Bernoulli\"s equation,Mach number, Pressure and airspeed measurement, Boundary Layer,Reynolds number, Laminar and Turbulent flow. Airfoils and wings: pressure coefficient and lift calculation, Critical Mach number, Wave drag, Finite wings, Induced drag, Swept wings. Aircraft performance: steady level flight, Altitude effects, Absolute ceiling, steady climbing flight, Energy methods, Range and Endurance, Sustained level turn, pull-up, V-n diagram, Take off and landing. Reentry vehicles: Ballistic and Glide Reentry, Blunt body concept.", "Prerequisite": "Nil", "TextReference": "Ojha S.K., Flight Performance of Aircraft, AIAA Series, 1995.Anderson, J.D., Introduction to Flight, McGraw Hill, 1989. Hale, J.F., Introduction to Aircraft Performance, Selection and Design, John Wiley, 1984.", "LastUpdate": "01-12-2015", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1003, "Department": "Aerospace Engineering", "Code": "AE 312", "Title": "Aerodynamics Laboratory", "TotalCredits": "5", "Description": "Types of wind tunnels and their characteristics, wind tunnel corrections Flow past bluff and a streamlined bodies and measurement of pressure drag. Wall shear flows, free shear flows, development of boundary layer on flat plate with and without pressure gradient, free shear layer in a jet, estimation of drag by wake survey method. Flow in a variable area duct and experimental determination of mass flow coefficient. Flow visualization methods, surface flow methods and color die injection method. Measurement of unsteady flow using hot-wire and Laser Doppler Velocimeter", "Prerequisite": "AE 206", "TextReference": "1. Goldstein, R. J., Fluid Mechanics Measurements, Taylor and Francis, 1996. 2. Pope A., and Goin, K. W., High Speed Wind Tunnel Testing, John Wiley & Sons, 1985. 3. Barlow, J. B., Rae, W. H., Pope, A., Low-Speed Wind Tunnel Testing, 3rd Ed., ISBN 978-0471557746, Wiley-Interscience, 1999.", "LastUpdate": "18-08-2015", "Structure": {"Type": "L", "Lecture": "1", "Tutorial": "3", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1004, "Department": "Aerospace Engineering", "Code": "AE 314", "Title": "Aircraft Structures Laboratory", "TotalCredits": "5", "Description": "The aerospace structures laboratory includes experiments related to material aspects as well as structural mechanics. These experiments are largely based upon the syllabus covered in the courses on solid mechanics and aerospace structures. A couple of experiments on vibrations and structural dynamics are also included for exposure. The experiments in this laboratory course cover the following.Fabrication of fibre reinforced composite laminate; tension, compression, interlaminar shear, impact and hardness testing for determination of elastic moduli and strength of material; coefficient of thermal expansion; strain measurement; inverse methods for material property determination (Poisson`s ratio and Youngs Modulus) using measured static and dynamic structural response in conjunction with simple structural models; shear centre of open section thin-walled beam, displacement and strain distribution in bending and torsion of twin-walled open and closed section beams; Buckling of beams/plates; measurement of natural frequency, natural modes and modal damping of beams.", "Prerequisite": null, "TextReference": "Laboratory Manual, Aircraft Structures Lab., Dept. of Aerospace Engineering, IIT Bombay, 2007.", "LastUpdate": "18-08-2015", "Structure": {"Type": "L", "Lecture": "1", "Tutorial": "3", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1005, "Department": "Aerospace Engineering", "Code": "AE 316", "Title": "Aircraft Propulsion Laboratory", "TotalCredits": "5", "Description": "Study of aircraft engine models, basic measurement techniques inthermal, mechanical and fluid systems.Experimentation related to aerodynamics and performance ofturbomachinery (in axial flow fan set-up and in two-dimensionalcompressor/turbine cascades), fuel systems, combustion and heattransfer (convective heat transfer to geometries typical of aerospacepropulsion applications) in aerospace propulsion systems.Experiments on performance characteristics of gas turbine/jetpropulsion systems.", "Prerequisite": "AE 329", "TextReference": "1. Hill, P., and Peterson, C., Mechanics and Thermodynamics of Propulsion, ISBN 978-0132465489, Pearson Education, 2009. 2. Laboratory Manual, Propulsion Laboratory, Department of Aerospace Engineering, IIT Bombay, 2007.", "LastUpdate": "18-08-2015", "Structure": {"Type": "L", "Lecture": "1", "Tutorial": "3", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1006, "Department": "Aerospace Engineering", "Code": "AE 611", "Title": "Aerodynamics Lab", "TotalCredits": "4", "Description": "Experimental studies based on Aerodynamics courses.", "Prerequisite": null, "TextReference": null, "LastUpdate": "03-04-2003", "Structure": {"Type": "L", "Lecture": "4", "Tutorial": "0", "Practical": "4", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1007, "Department": "Aerospace Engineering", "Code": "AE 710", "Title": "Aeroacoustics", "TotalCredits": "6", "Description": "1.Introduction1.Background and definition of aeroacoustics2.Linearity of acoustics2.Aspects of classical acoustic theory1.Governing equations for 1-D acoustics2.Governing equations for 3-D acoustics3.1-D and spherically-symmetric acoustics in a medium at rest4.Kovasznay302222s decomposition of linearized fluid fluctuations5.Elements of solutions of Helmholtz equation3.Acoustic fluctuations in non-uniform media (sheared flows)4.Sources of aeroacoustic sound and their resultant fields1.Non-uniqueness of source identified from measured sound field2.Sound field of oscillating spheres (as elemental sources)3.Introduction to generalized functions and Green302222s theory for solution of partial differential equations, as required in acoustics4.Sound field due to monopole, dipole and quadrupole sources, their importance, and their relation with oscillating spheres5.Analysis of sound due to moving sources6.Reciprocal theorem in linear acoustics5.Kirchhoff302222s formula of linear acoustics in the presence of surfaces6.Lighthill302222s theory, and application to jet noise7.Ffowcs-Williams and Hawkings302222 formulation of nonlinear acoustics in the presence of surfaces8.Scattering of sound at an edge, as applicable to airfoil noise9.Study of current literature on various topics of aeroacoustics", "Prerequisite": null, "TextReference": "1.Goldstein, M. E., Aeroacoustics, McGraw-Hill, 19762.Crighton, D. G., Basic principles of aerodynamic noise generation, Prog. Aerospace Sci., 16(1), 1975 pp. 31-963.Dowling, A. P. and Ffowcs-Williams, J. E., Sound and sources of sound, Ellis Horwood Publishers, 1983", "LastUpdate": "06-10-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1008, "Department": "Aerospace Engineering", "Code": "AE 711", "Title": "Aircraft Propulsion", "TotalCredits": "6", "Description": "Introduction to various aircraft propulsive devices: Piston-prop, Turbo-prop,Turbojet, Turbofan, Turboshaft, Ramjet,Vectored- thrust, Lift engines. Gas Turbine Cycles and cycle based performance analysis; 1-D and 2-D analyis of flow through gas turbine components - Intake, Compressors, Turbines, Combustion Chamber, Afterburner, and Nozzle. Compressor and Turbine blade shapes ; cascade theory; radial equilibrium theory ; matching of compressor and Turbine. Turbine cooling. Single spool and Multi- spool engines. Powerplant performance with varying speed and altitude.", "Prerequisite": "nil", "TextReference": "Cohen,Rogers, and Saravanamuttoo, Gas Turbine Theory, Longman, 1987. G.C (r) Oates, Aerothermodynamics of Aircraft Engine Components, AIAA, 1985.", "LastUpdate": "03-04-2003", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1009, "Department": "Aerospace Engineering", "Code": "AE 713", "Title": "Space Flight Dynamics", "TotalCredits": "6", "Description": "Introduction to spacecraft, rockets & missiles, their basic functions and features, some examples. Fundamentals of Rocket Performance, simplified equations of variable mass rocket motion. Evaluation of rocket/missile trajectories as projectile motion, rectilinear motion in vaccum and in atmosphere , velocity-mass relations & other other performance calculations and the gravity turn trajectory. Jet damping effect and concept of multistaging in launch vehicles & missilles. Fundamentals of constrained optimization in multistage rockets. Central force motion, Two body & three body problem, Kepler s law of planetary motion, Geometry of conic sections and orbit determination from initial conditions Spacecraft orbit transfer, attitude motion, stability and control of the attitude motion.", "Prerequisite": null, "TextReference": "M.H. Kaplan, Modern Spacecraft Dynamics & Control, John Wiley, 1976. J.W. Cornnelisse, Rocket Propulsion and Space flight Dynamics, Pitman, 1979. W.T. Thompson, Introduction to Space Dynamics, John Wiley, 1963.", "LastUpdate": "03-04-2003", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1010, "Department": "Aerospace Engineering", "Code": "AE 714", "Title": "Aircraft Design", "TotalCredits": "6", "Description": "Types of Aerial vehicles, their basic principles, advantages, disadvantages, limitations. Product System design process. Formulation of problem-objective function, constraints. Solutions. Aircraft project phases. Configuration: Types and comparison of wing, tail, fuselage, landing Gear. Wing-tail combinations, Powerplant (types, numbers, locations). Estimation of C, Field length, Allowable CG range, Thrust vs. speed and Altitude for Propeller and Jet. Estimation of preliminary weight, Acquisition cost. Operating cost. Rubber Engine Sizing : Fixed engine sizing: Detailed weights, detailed geometry, etc. Detailed design: v-n diagram, design loads, structural layout. Introduction to advanced concepts in aircraft design.", "Prerequisite": "Nil", "TextReference": "D.P. Raymer,Aircraft Design - A conceptual approach, AIAA Educational Series, 1990. E. Torenbeek, Synthesis of Subsonic Airplane Design, Delft University Press, 1977.", "LastUpdate": "03-04-2003", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 1011, "Department": "Aerospace Engineering", "Code": "AE 717", "Title": "Aircraft Flight Dynamics", "TotalCredits": "6", "Description": "Static stanbility: Longitudinal neural point in stick fixed and stick free comditions, directional stability, Longitudinal and directional control. Lateral stability and control. Equations of motion of rigid aircraft in body fixed axes. Stability axes, stability derivatives. Steady flight and perturbed flight. Various logitudinal and lateral-directional modes. Linearisation of the equations of motion. Decoupling of lateral-directional motion from longitudional motion.", "Prerequisite": "AE 152", "TextReference": "J. Roskam, Flight Dynamics of Rigid and Elastic Airplanes, University of Kansas Press, 1972. R.C. Nelson, Flight Stability and Automatic Control, McGraw Hill, 1990. B.Etkin, Dynamics of Atmospheric Flight, John Wiley, 1972.", "LastUpdate": "03-01-2005", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 2001, "Department": "Applied Geophysics", "Code": "GP 414", "Title": "Electrical Methods", "TotalCredits": "4", "Description": "Electrical properties of rocks; Introduction to Electrical methods of geophysical prospecting, Principles of Resistivity methods, Instruments for Resistivity methods; Resistivity field surveys in different array configurations (Wenner, Schlumberger, dipole-dipole, pole-pole, pole-dipole), Profiling and Sounding techniques, Resistivity imaging, Resistivity Data analysis and Interpretation; Induced Polarization and Self-potential methods, Concepts of groundwater accumulation, geology of groundwater occurrence, types of aquifers and their characteristics, resistivity methods for groundwater exploration and some case histories.", "Prerequisite": null, "TextReference": "1.W.M. Telford, L.P.Geldart, and R.E.Sheriff, Applied geophysics, Cambridge, 1990. 2.M.B.Dobrin, and C.H. Savit, Introduction to geophysical prospecting, McGraw Hill, 1988.3. G. V. Keller, Electrical Methods of Geophysical Prospecting, Pergamon Press, 1980.4. Fetter, C.W., 2001. Applied Hydrogeology, Fourth ed. Prentice Hall, NJ, USA.", "LastUpdate": "23-04-2013", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 2002, "Department": "Applied Geophysics", "Code": "GP 415", "Title": "Mineralogy & Petrology Lab", "TotalCredits": "3", "Description": "Identification of rock forming minerals, megascopic and microscopic study. X-ray diffraction, Identification and classification of rocks, textures and mineral compositions of igneous, sedimentary and metamorphic rocks.", "Prerequisite": null, "TextReference": "1. Ness, W.D. Optical Mineralogy. 348p, Oxford University Press, 2004 2. Klein, C. Manual of Mineral Science, 22nd Edition. John Wiley and Sons, 2001. 3. Williams, H., Turner, F.J. and Gilbert, C.M. Petrography: An Introduction to the Study of Rocks in Thin Sections, CBS Publishers and Distributors, 1985.", "LastUpdate": null, "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "0", "Practical": "3", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 2003, "Department": "Applied Geophysics", "Code": "GP 416", "Title": "Structural Geology & Stratigraphy", "TotalCredits": "6", "Description": "Planes and lines in structural geology, dip, strike, pitch, plunge; principles and applications of stereo-net; folds, faults, joints, foliations, lineations. Introduction to stress and strain, ductile and brittle deformations; modeling rocks as a laminar fluid, Couette- and Poiseuille flow along and across gravity-geoscientific applications. Structure and major tectonic features of the Indian subcontinent. Principles of stratigraphy; stratigraphic classification and correlation. Facies concepts and facies analysis. Stratigraphy, tectonics and geochronology of the Precambrians of India; Palaeozoic and Mesozoic formations of Himalaya and Peninsular India, Gondwana sequence; subsurface geology of Bengal, Assam, Cauvery, Krishna-Godavari, Cambay, Kutch, Rajasthan basins.", "Prerequisite": null, "TextReference": "1.Krishnan, M.S. Geology of India and Burma, CBS Publ. & Distr., 1982. Ravindra Kumar Fundamentals of Historical Geology and Stratigraphy of India, Wiley Eastern. 1985. 2.Naqvi, S.M. Geology and Evolution of the Indian Plate, Capital Publishing Company, 2005. 3. Billings, M.P. Structural Geology. Prentice Hall, 1972 4. Davis, G. H., Reynolds, S.J. Structural Geology of Rocks and Regions, 1996", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 2004, "Department": "Applied Geophysics", "Code": "GP 418", "Title": "Exploration Seismology I", "TotalCredits": "6", "Description": "Theory and geometry of seismic waves, seismic velocity of rocks, characteristics of seismic events, seismic sources and equipment. seismic reflection and refraction field methods, CDP technique, seismic noise, velocity measurements, marine seismic surveys, data processing - convolution, correlation, filtering, velocity analysis, stacking and migration, synthetic seismograms, seismic interpretation.", "Prerequisite": null, "TextReference": "1. C.L.Liner, Elements of 3D seismology, Pennwell Corporation, U.S., 2004. 2. Sheriff,R.E. and Geldart,L.P. Exploration seismology, Cambridge Univ. Press 1995. 3. W.M. Telford, L.P.Geldart, and R.E.Sheriff, Applied geophysics, Cambridge Univ. Press 1990. 4. M.B.Dobrin, and C.H. Savit, Introduction to geophysical prospecting, McGraw Hill, 1988. 5. E. S. Robinson and C. Coruh, Basic Exploration Geophysics, John Wiley and Sons, New York, 1988.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 2005, "Department": "Applied Geophysics", "Code": "GP 516", "Title": "Petroleum Geology and Petrophysics", "TotalCredits": "6", "Description": "Introduction to Petroleum geology, Physical and chemical properties of petroleum, subsurface environment, generation and migration of petroleum, traps and seals, sedimentary basins, assessment of basin reserves and global reserves, Introduction to Petrophysics, rock fluid system and interaction, reservoir characteristics, relationship between porosity, permeability and texture, forward modeling and prediction of effects of porosity, lithology and fluids on seismic attributes, Correlation of well log parameters with seismic properties, bulk properties and pore fluid conditions.", "Prerequisite": "Nil", "TextReference": "1. R.C.Selley, Elements of petroleum geology, Academic press, 1997. 2. D.Tiab and E.C.Donaldson, Petrophysics: Theory and Practice of measuring reservoir rock and fluid transport properties, Gulf Professional publishers, 2003. 3. J. Gluyas, R.E. Swarbrick, Petroleum Geoscience, Blackwell Science, 2003. 4. G. Mavko, T. Mukerjee and J. Dvorkin, The Rock Physics handbook: Tools for seismic analysis of porous media, Cambridge, 1998. 5. J.R. Fanchi, Principles of applied reservoir simulation, Gulf Publishing, 1997.", "LastUpdate": "19-06-2009", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 2006, "Department": "Applied Geophysics", "Code": "GP 518", "Title": "Process Geomorphology, Remote Sensing and GIS", "TotalCredits": "6", "Description": "Geomorphic principles and processes, pedogenesis and morphogenetic regions. Concept of cycle of erosion; fluvial, aeolian, coastal, karst and glacial landscapes, methods of analysis of landforms, slopes and drainage. Aplications of geomorphology. Fundamental concepts of remote sensing; electromagnetic energy and its interactions in the atmosphere and with terrain features; elements of photographic systems, aerial photointerpretation and geological applications, Fundamentals of photogrammetry, satellite remote sensing, multi-spectral scanners, thermal scanners, microwave remote sensing, fundamentals of image interpretation and geological applications, Introduction to digital image processing. Introduction to Geographic Information System, spatial data models and data structures, visualization and query of spatial data, overlay analysis, geological applications of GIS.", "Prerequisite": null, "TextReference": "1. Thornbury, W.D. Principles of Geomorphology, Wiley Eastern, 1993. 2. Holmes, A. Physical Geology, Nelson, 1965. 3. Sabnis, F.F. Remote sensing - Principles and Interpretation, W.H. Freeman and Co., 1978. 4. Lillesand, T.M. and Kiefer, R.W. Remote sensing and Image Interpretation, John Wiley, 1987. 5. Pandey, S.N. Principles and Applications of Photogeology, Wiley Eastern, 1987. 6. Bonham Carter, G.F. GIS for Geoscientists- Modelling with GIS, Elsevier, 1994.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 3001, "Department": "Applied Statistics and Informatics", "Code": "SI 416", "Title": "Optimization", "TotalCredits": "6", "Description": "Unconstrained optimization using calculus (Taylor`s theorem, convex functions, coercive functions). Unconstrained optimization via iterative methods (Newton`s method, Gradient/ conjugate gradient based methods, Quasi-Newton methods). Constrained optimization (Penalty methods, Lagrange multipliers, Karush-Kuhn-Tucker conditions). Introduction to Linear Programming: Lines and hyperplanes, Convex sets, Convex hull, Formulation of a Linear Programming Problem, Theorems dealing with vertices of feasible regions and optimality, Graphical solution. Simplex method (including Big M method and two-phase method), Dual problem, Duality theory, Dual simplex method, Revised simplex method", "Prerequisite": "Nil", "TextReference": "Beale, E.M.L., and Mackley, L. , Introduction to Optimization, John Wiley & Sons, Hoboken, 1988. Chavatal, V., Linear Programming, W.H. Reeman and Company, New York, 1983. Chong, E.P.K. and Zak, S.H., An Introduction to Optimization, 4th Edition, John Wiley & Sons, Hoboken, 2013. Joshi, M.C., and Moudgalya, K., Optimization: Theory and Practice, Narosa, New Delhi, 2004. Nocedal, J. and Wright, S. J., Numerical Optimization, 2nd Edition, Springer, New York, 2006. Vanderbei, R.J., Linear Programming Foundations and Extensions, 3rd Edition, Springer, New York, 2008.", "LastUpdate": "17-05-2021", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 3002, "Department": "Applied Statistics and Informatics", "Code": "SI 514", "Title": "Statistical Modeling", "TotalCredits": "6", "Description": "Nonlinear regression, Nonparametric regression, generalized additive models, Bootstrap methods, kernel methods, neural network, Artificial Intelligence, a few topics from machine learning.", "Prerequisite": null, "TextReference": "T. Hastie, and R. Tibshirani, Generalized Additive Models, Chapman and Hall, London, 1990.G.A.F. Seber, and C.J. Wild, Nonlinear Regression, John Wiley & Sons, 1989.W. Hardle, Applied Nonparametric Regression, Cambridge University Press, London, 1990.", "LastUpdate": "05-07-2015", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4001, "Department": "Biosciences & Bioengineering", "Code": "BB 101", "Title": "Biology", "TotalCredits": "6", "Description": "Quantitative views of modern biology. Importance of illustrations and building quantitative/qualitative models. Role of estimates. Cell size and shape. Temporal scales. Relative time in Biology. Key model systems - a glimpse. Management and transformation of energy in cells. Mathematical view - binding, gene expression and osmotic pressure as examples. Metabolism. Cell communication. Genetics. Eukaryotic genomes. Genetic basis of development. Evolution and diversity. Systems biology and illustrative examples of applications of Engineering in Biology.", "Prerequisite": null, "TextReference": "(1)Physical Biology of the Cell. By R. Phillips, J. Kondev and J. Theriot. Garland science publishers. 2008. 1st edition. (2)Campbell Biology. By J.B.Reece, L.A.Urry, M.L.Cain, S.A.Wasserman, P.V.Minorsky, R.B.Jackson. Benjamin Cummings publishers. 2010. 9th edition.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4002, "Department": "Biosciences & Bioengineering", "Code": "BB 410", "Title": "Bioinformatics", "TotalCredits": "5", "Description": "Bioinformatics basics: Searching PubMed, current content, science citation index and current awareness services, electronic journals, grants and funding information. Computers in biology and medicine; Introduction to Unix and Linux systems and basic commands; Database concepts; Protein and nucleic acid databases; Structural databases; Biological XML DTD’s; pattern matching algorithm basics; databases and search tools: biological background for sequence analysis; Identification of protein sequence from DNA sequence; searching of databases similar sequence; NCBI; publicly available tools; resources at EBI; resources on web; database mining tools. BLAST: sequence alignment- methods, evaluation, scoring; Use of various primer designing and restriction site prediction tools. Use of miRNA prediction, designing and target prediction tools. DNA sequence analysis: gene bank sequence database; submitting DNA sequences to databases and database searching; sequence alignment; pairwise alignment techniques; motif discovery and gene prediction (GRAIL, Genscan, Glimmer); local structural variants of DNA, their relevance in molecular level processes, and their identification; assembly of data from genome sequencing. Multiple sequence analysis; multiple sequence alignment; flexible sequence similarity searching with the FASTA3 program package; use of CLUSTALW and CLUSTALX for multiple sequence alignment; submitting DNA protein sequence to databases: where and how to submit, SEQUIN, genome centres; submitting aligned sets of sequences, updating submitted sequences, methods of phylogenetic analysis.", "Prerequisite": null, "TextReference": "Title, Authors, Edition, Publisher, Year 1. Lesk, A. M. (2002). Introduction to Bioinformatics. Oxford: Oxford University Press. 2. Mount, D. W. (2001). Bioinformatics: Sequence and Genome Analysis. Cold Spring Harbor, NY: Cold Spring Harbor Laboratory Press. 3. Baxevanis, A. D., & Ouellette, B. F. (2001). Bioinformatics: a Practical Guide to the Analysis of Genes and Proteins. New York: Wiley-Interscience. 4. Pevsner, J. (2015). Bioinformatics and Functional Genomics. Hoboken, NJ.: Wiley- Blackwell. 5. Bourne, P. E., & Gu, J. (2009). Structural Bioinformatics. Hoboken, NJ: Wiley-Liss. 6. Lesk, A. M. (2004). Introduction to Protein Science: Architecture, Function, and Genomics. Oxford: Oxford University Press.", "LastUpdate": "27-07-2020", "Structure": {"Type": "L", "Lecture": "1", "Tutorial": "0", "Practical": "3", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4003, "Department": "Biosciences & Bioengineering", "Code": "BB 414", "Title": "Molecular Diagnostics", "TotalCredits": "3", "Description": "DNA, RNA, Protein: An overview; chromosomal structure & mutations; DNA polymorphism: human identity; clinical variability and genetically determined adverse reactions to drugs. PCR: Real-time; ARMS; Multiplex; ISH; FISH; ISA; RFLP; DHPLC; DGGE; CSCE; SSCP; Nucleic acid sequencing: new generations of automated sequencers; Microarray chips; EST; SAGE; microarray data normalization & analysis; molecular markers: 16S rRNA typing; Diagnostic proteomics: SELDI-TOF-MS; Bioinformatics data acquisition & analysis. Metabolite profile for biomarker detection the body fluids/tissues in various metabolic disorders by making using LCMS & NMR technological platforms. Direct detection and identification of pathogenic-organisms that are slow growing or currently lacking a system of in vitro cultivation as well as genotypic markers of microbial resistance to specific antibiotics. Exemplified by two inherited diseases for which molecular diagnosis has provided a dramatic improvement of quality of medical care: Fragile X Syndrome: Paradigm of new mutational mechanism of unstable triplet repeats, von-Hippel Lindau disease: recent acquisition in growing number of familial cancer syndromes. Detection of recognized genetic aberrations in clinical samples from cancer patients; types of cancer-causing alterations revealed by next-generation sequencing of clinical isolates; predictive biomarkers for personalized onco-therapy of human diseases such as chronic myeloid leukemia, colon, breast, lung cancer and melanoma as well as matching targeted therapies with patients and preventing toxicity of standard systemic therapies. Quality oversight; regulations and approved testing.", "Prerequisite": null, "TextReference": "Title, Authors, Edition, Publisher, Year 1. Campbell, A. M., & Heyer, L. J. (2006). Discovering Genomics, Proteomics, and Bioinformatics. San Francisco: Benjamin Cummings. 2. Brooker, R. J. (2009). Genetics: Analysis & Principles. New York, NY: McGraw-Hill. 20 3. Glick, B. R., Pasternak, J. J., & Patten, C. L. (2010). Molecular Biotechnology: Principles and Applications of Recombinant DNA. Washington, DC: ASM Press. 4. Coleman, W. B., & Tsongalis, G. J. (2010). Molecular Diagnostics: for the Clinical Laboratorian. Totowa, NJ: Humana Press", "LastUpdate": "27-07-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 4004, "Department": "Biosciences & Bioengineering", "Code": "BB 416", "Title": "Research Methodology and Scientific Communication Skills", "TotalCredits": "3", "Description": "Empirical science; scientific method; manipulative experiments and controls; deductive and inductive reasoning; descriptive science; reductionist vs holistic biology. Choosing a mentor, lab and research question; maintaining a lab notebook. Concept of effective communication- setting clear goals for communication; determining outcomes and results; initiating communication; avoiding breakdowns while communicating; creating value in conversation; barriers to effective communication; non-verbal communication-interpreting non-verbal cues; importance of body language, power of effective listening; recognizing cultural differences; Presentation skills - formal presentation skills; preparing and presenting using over-head projector, PowerPoint; defending interrogation; scientific poster preparation & presentation; participating in group discussions; Computing skills for scientific research - web browsing for information search; search engines and their mechanism of searching; hidden Web and its importance in scientific research; internet as a medium of interaction between scientists; effective email strategy using the right tone and conciseness. Technical writing skills - types of reports; layout of a formal report; scientific writing skills - importance of communicating science; problems while writing a scientific document; plagiarism, software for plagiarism; scientific publication writing: elements of a scientific paper including abstract, introduction, materials & methods, results, discussion, references; drafting titles and framing abstracts; publishing scientific papers - peer review process and problems, recent developments such as open access and non-blind review; plagiarism; characteristics of effective technical communication; scientific presentations; ethical issues; scientific misconduct.", "Prerequisite": null, "TextReference": "Title, Authors, Edition, Publisher, Year 1. Valiela, I. (2001). Doing Science: Design, Analysis, and Communication of Scientific Research. Oxford: Oxford University Press. 2. On Being a Scientist: a Guide to Responsible Conduct in Research. (2009). Washington, D.C.: National Academies Press. 3. Gopen, G. D., & Smith, J. A. The Science of Scientific Writing. American Scientist, 78 (Nov-Dec 1990), 550-558. 4. Mohan, K., & Singh, N. P. (2010). Speaking English Effectively. Delhi: Macmillan India. 5. Movie: Naturally Obsessed, The Making of a Scientist.", "LastUpdate": "27-07-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 4005, "Department": "Biosciences & Bioengineering", "Code": "BB 513", "Title": "Critical Analysis of Classical Papers (Seminar)", "TotalCredits": "4", "Description": "Students may be divided in groups and each group may be responsible for one classical paper. Each week there may be a 1.5 hour presentation cum discussion for each of the papers. At the end of the semester each student will be asked to write a mini-review (2-3 pages long) on any one classical paper, other than the one he/she presented/discussed. A list of sixteen classic papers and some suggested reference materials: Molecular Biology 1. Studies on the chemical nature of the substance inducing transformation of Pneumococcal types: Induction of transformation by a desoxyribonucleic acid fraction isolated from Pneumococcus type III. Avery OT, Macleod CM, McCarty M.; J Exp Med. 1944 Feb 1;79(2):137-58. Note: This paper demonstrates that DNA is the transforming Principle originally described by Fredrick Griffith. 2. Independent functions of viral protein and nucleic acid in growth of bacteriophage Hershey AD and Chase M.; J Gen Physiol. 1952 May;36(1):39-56. Note: This paper demonstrates that DNA, and not protein, component of phages enter bacterial cells. 3. Molecular structure of nucleic acids; a structure for deoxyribose nucleic acid Watson JD and Crick FH; Nature. 1953 Apr 25;171(4356):737-8 Note: In this one page paper Watson and Crick first described the structure of DNA double helix Study help - Watson_Crick_Nature_1953_annotated 4. Transposable mating type genes in Saccharomyces cerevisiae James Hicks, Jeffrey N. Strathern & Amar J.S. Klar; Nature 282, 478-483,1979 Note: This paper provided evidence for ‘cassette hypothesis’ of yeast mating type switches i.e. interconversion of mating types in yeast (S. cerevisiae) occurs by DNA rearrangement. 5. Messelson & Stahl experiment demonstrating semi-conservative replication of DNA. Meselson M and Stahl FW.; Proc Natl Acad Sci U S A. 1958 Jul 15;44(7):671-82 Note: The experiment demonstrating semi-conservative mode of DNA replication is referred to as \"the most beautiful experiment in biology\" 6. In vivo alteration of telomere sequences and senescence caused by mutated Tetrahymena telomerase RNAs Guo-Liang Yu, John D. Bradley, Laura D. Attardi & Elizabeth H. Blackburn; Nature 344, 126-132, 1990 Note: This paper demonstrates that the telomerase contains the template for telomere synthesis. Cell Biology 1. A protein-conducting channel in the endoplasmic reticulum Simon SM AND Blobel G.; Cell. 1991 May 3;65(3):371-80 Note: This paper demonstrates the existence of a protein conducting channel Study help - A brief history of Signal Hypothesis. 2. Identification of 23 complementation groups required for post-translational events in the yeast secretory pathway Novick P, Field C, Schekman R.; Cell. 1980 Aug;21(1):205-15 Note: In this groundbreaking paper Randy Schekman`s group used a mutagenesis screen for fast sedimenting yeast mutants to identify genes involved in cell secretion 3. A yeast mutant defective at an early stage in import of secretory protein precursors into the endoplasmic reticulum Deshaies RJ and Schekman R.; J Cell Biol. 1987 Aug;105(2):633-45 Note: Using another yeast mutation screen Schekman lab identifies Sec61, a component of ER protein Conducting Channel (PCC) Suggested reference paper - A biochemical assay for identification of PCC. 4. Reconstitution of the Transport of Protein between Successive Compartments of the Golgi Balch WE, Dunphy WG, Braell WA, Rothman JE.; Cell. 1984 Dec;39(2 Pt 1):405-16 Note: This paper describes setting up of an in vitro reconstituted system for transport between golgi stacks which eventually paved the way for identification of most of the molecular players involved in these steps including NSF, SNAP etc. 5. A complete immunoglobulin gene is created by somatic recombination Brack C, Hirama M, Lenhard-Schuller R, Tonegawa S.; Cell. 1978 Sep;15(1):1-14 Note: This study demonstrates DNA level molecular details of somatic rearrangement of immunoglobulin gene sequences leading to the generation of functionally competent antibody generating gene following recombination. 6. A novel multigene family may encode odorant receptors: a molecular basis for odor recognition Buck L and Axel R; Cell. 1991 Apr 5;65(1):175-87 Note: This paper suggests that different chemical odorants associate with different cell-specific expression of a transmembrane receptor in Drosophila olfactory epithelium where a large family of odorat receptors is expressed. 7. Kinesin walks hand-over-hand Yildiz A, Tomishige M, Vale RD, Selvin PR.; Science. 2004 Jan 30;303(5658):676-8 Note: This paper shows that kinesin motor works as a two-headed dimeric motor walking hand-over-hand rather than like an inchworm on microtubule tract using the energy of ATP hydrolysis. Developmental Biology/ Genetics 1. Mutations affecting segment number and polarity in Drosophila Christiane Nusslein-Volhard and Eric Weischaus; Nature 287, 795-801, 1980 Note: This single mutagenesis screen identified majority of the developmentally important genes not only in flies but in other metazoans as well. 2. Information for the dorsal--ventral pattern of the Drosophila embryo is stored as maternal mRNA Anderson KV and Nüsslein-Volhard C; Nature. 1984 Sep 20-26;311(5983):223-7 Note: This landmark paper demonstrated that early dorsal-ventral pattern information is stored as maternal mRNA in flies and devised the method of identifying genes encoding such genes 3. Hedgehog signalling in the mouse requires intraflagellar transport proteins Huangfu D, Liu A, Rakeman AS, Murcia NS, Niswander L, Anderson KV.; Nature. 2003 Nov 6;426(6962):83-7 Note: One of the architects of original fly mutagenesis screens conducted a mouse mutagenes screen which identified a gene Kif3a as a major component of hedgehog signaling pathway. Eventually this discovery revolutionizes our understanding of mechanisms of action of signaling pathways by demonstrating central role of cillia in it. Suggested Reference paper - Design and execution of a embryonic lethal mutation screen in mouse.", "Prerequisite": null, "TextReference": "N.A.", "LastUpdate": "27-07-2020", "Structure": {"Type": "S", "Lecture": "0", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4006, "Department": "Biosciences & Bioengineering", "Code": "BB 519", "Title": "Project Proposal Presentation and Dissertation", "TotalCredits": "10", "Description": "Selection of research lab and research topic: Students should first select a lab wherein they would like to pursue their dissertation. The supervisor or senior researchers should be able to help the students to read papers in the areas of interest of the lab and help them select a topic for their project. The topic of the research should be hypothesis driven. Review of literature: Students should engage in systematic and critical review of appropriate and relevant information sources and appropriately apply qualitative and/or quantitative evaluation processes to original data; keeping in mind ethical standards of conduct in the collection and evaluation of data and other resources. Writing Research Proposal: With the help of the senior researchers, students should be able to discuss the research questions, goals, approach, methodology, data collection, etc. Students should be able to construct a logical outline for the project including analysis steps and expected outcomes and prepare a complete proposal in scientific proposal format for dissertation. Poster Presentation Students will have to present the topic of their project proposal after few months of their selection of the topic. They should be able to explain the novelty and importance of their research topic. Oral Presentation At the end of their project, presentation will have to be given by the students to explain work done by them in detail. Along with summarizing their findings they should also be able to discuss the future expected outcome of their work.", "Prerequisite": null, "TextReference": "N.A.", "LastUpdate": "27-07-2020", "Structure": {"Type": "P", "Lecture": "0", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4007, "Department": "Biosciences & Bioengineering", "Code": "BB 551", "Title": "Genetic Engineering Laboratory", "TotalCredits": "10", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": "27-06-2015", "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "10", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4008, "Department": "Biosciences & Bioengineering", "Code": "BB 610", "Title": "Biomedical Microsystems", "TotalCredits": "6", "Description": "Introduction; Photolithography; Crystallography, Mask Design Wet and Dry Etching; Thin Film Deposition and Growth Electroplating, Molding, LIGA, Bonding and Sacrificial Processes, Polymer Processing and Rapid Prototyping, u-TAS: Fluid Control Components, Sample Handling, Separation Components and Detection, Cell Handling and Characterization Systems, Systems for Biotechnology and PCR, Miniature Biosensors, Biosensor Arrays and Implantable Devices Neural Interfaces, Microsurgical Tools, Microneedles, and Drug Delivery, Miniature Bioreactors and Microsystems for Tissue Engineering, Optical Biosensors, Packaging of Microfluidic and Optical Systems, Nanotechnology, Metrology", "Prerequisite": null, "TextReference": "A. Manz and H. Becker, Eds., Microsystem Technology in Chemistry and Life Sciences, Springer-Verlag, New York, 1999. Marc J. Madou, Fundamentals of Microfabrication: The Science of Miniaturization, Second Edition, CRC Press; 2nd edition, 2002", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4009, "Department": "Biosciences & Bioengineering", "Code": "BB 611", "Title": "Cell Cycle and Epigenetic Control", "TotalCredits": "6", "Description": "Overview of cell cycle, cell cycle of modelorganisms, events of eukaryotic cell cycle -chromosome duplication and control of replicationonce per cell cycle, assembly of mitotic spindle,kinetochore capture and sister chromatid bi-orientation, chromosome segregation, mitotic exit,genetic control of cell cycle, epigenetic control ofcell cycle, epigenetic regulation of transcription:RNAi and heterochromatin formation, chromatinremodelling and importance of histone variants,epigenetic regulation of centromere identity andchromosome inheritance; dosage compensation andgenomic imprinting in Mammals, reprogramming ofthe genome, epigenetic determinants of earlyembryonic stem cells and cellular differentiation,epigenetic determinants of cancer and aging.", "Prerequisite": "BT 251", "TextReference": "The Cell Cycle: Principles of control. David O Morgan. Publisher: New Science Press limited. 1st Edition, 2007 Cell Cycle Control: Mechanisms and Protocols (Methods in Molecular Biology Vol296) Tim Humphrey (Editor), Gavin Brooks (Editor). Publisher: Humana Press 2010 Epigenetics . By C. David Allis, Thomas Jenuwein Danny Reinberg , Marie-Laure Caparros . Publisher: CSHL press 1st Edition, 2007Handbook of Epigenetics: The New Molecular andMedical Genetics. By Trygve Tollefsbol (Editor).Publisher: Academic Press. 1st Edition, 2010", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4010, "Department": "Biosciences & Bioengineering", "Code": "BB 612", "Title": "Cell Mechanics and Mechanobiology", "TotalCredits": "6", "Description": "Mechanical forces are known to play an increasinglyimportant role during development, normal functionas well as in disease. This course will focus on thephysical interactions between cells and theirsurroundings. Students will learn how cells sense andrespond to external forces and cues, and how thesemechanical inputs influence subcellular biochemistryand cell behavior. They will also study variousexperimental techniques that have been developed forprobing cell structure, manipulating cells andmeasuring their mechanical properties.", "Prerequisite": null, "TextReference": "Since this course will be research-oriented, there is, if no official textbook other than original research necessary) papers and reviews identified by the instructor. Students will be responsible for downloading and printing PDFs. B. Alberts, D. Bray, J. Levis, M. Raff, K. Roberts & J. D. Watson: Molecular Biology of the Cell; 5th Ed, Garland Science Fung, Y. C.: Biomechanics: Mechanical Properties of Living Tissues. 2nd Ed., Springer.R. Kamm and M. K. Mofrad. Cytoskeletal Mechanics: Models and Measurements. Cambridge University Press.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4011, "Department": "Biosciences & Bioengineering", "Code": "BB 616", "Title": "Cellular and Tissue Engineering", "TotalCredits": "6", "Description": "Basic cell biology, cell-matrix interactions, receptor biology, cell culture, gene therapy and gene transfer techniques, protein and peptide engineering, stem cell programming, controlled release and drug delivery, tissue ablation, engineering angiogenesis, vascularization, material based immuntherapy and case studies involving skin, bone, liver, muscle tissue engineering.", "Prerequisite": null, "TextReference": "1. Blitterswijk CV, Tissue Engineering, Academic Press (2008).2. Saltzman WM, Tissue Engineering, Oxford University Press (2004).3. Lanza RP, Langer R, Vacanti JP, Principles of Tissue Engineering, Academic Press, 3rd Edition (2007). 4. Palsson B and Bhatia SN, Tissue Engineering, Pearson Prentice Hall (2003).", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4012, "Department": "Biosciences & Bioengineering", "Code": "BB 618", "Title": "Medical Instrumentation", "TotalCredits": "6", "Description": "Medical measurands; Sensor characteristics and design for measurement of medical parameters like ECG, arterial flow, blood pressure, heart sounds; Biopotential amplifiers, charge amplifiers and other interfaces; Signal conditioning and display.Medical imaging considerations; X-rays, X-ray tube design, film and detector design; CT - scanners : generations and basic algorithms.Elements of electrical safety; Built-in safety features for medical instruments.", "Prerequisite": null, "TextReference": "John G. Webster (ed.) : Medical Instrumentation - Application and Design; Third Edition; John Wiley and Sons, New York, 1998.Richard Aston : Principles of Biomedical Instrumentation and Measurement, Merril Publishing Co., Columbus, 1990.Richard S.C. Cobbold : Transducers for Biomedical Measurements: Principles and Applications, John Wiley & Sons, 1974.Ernest O. Doeblin : Measurement Systems, Application and", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "2", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4013, "Department": "Biosciences & Bioengineering", "Code": "BB 621", "Title": "Biostatistics", "TotalCredits": "6", "Description": "Analytics in biology and medicine. Probability, statistics and stochastics. Applications in biology and medicine will be given at each topic below. A. Descriptive statistics, quantitative parameters and inferential statistics. B. Events and samples spaces, algebra of events, Venn diagram, random events, axiomatic definition of probability, probability as relative frequency. Independence, mutually exclusive events, conditional events, Bayes’ rule and theorem, counting-permutation-combination and probability, application to diagnostics, types of errors, evaluation of odds and risks. C. Random variables as functions, discrete and continuous random variables, probability mass function, common discrete distributions – Bernouli, Binomial, Geometric, Poisson, z-transform, marginal and joint distributions, applications D. Continuous random variables and distributions, Normal, exponential and gamma, Chi Square, t, and F distributions, characteristic/moment-generating functions E. Estimation of mean and variance and their distributions, Central Limit Theorem and sample size, confidence intervals, applications F. Testing for single or two populations for the mean with and without knowledge of variance, Normal and Student `t’ test, Chi Square/F test for the variance of one/two populations, G. G. Independence of attributes and Chi Square test for goodness of fit. H. Experimental design: randomization, factorial, Latin square, and sequential cross-over design, F Test and Applications. I. Non-parametric and distribution-free statistics, some important nonparametric tests; sign test, Wilcoxon`s rank test and Spearman`s rank, correlation. J. Classification (differential diagnosis), sequential clinical trials, and other applications. K. Introduction to regression and time-series, data mining for patterns, analytics. L. Laboratory sessions for descriptive statistics, testing and experimental design, using open source software R", "Prerequisite": null, "TextReference": "Martin Bland: An Introduction to Medical Statistics, Oxford University Press, 1995. Wayne Daniel: Biostatistics: Foundation for Analysis in the Health Sciences, 5th ed., John Wiley & Sons, New York, 2009. 9th Edition Marcello Pagano, Principles of Biostatistics, Cengage Learning India, 2000, 2nd Edition P. G. Hoel, S. C. Port, and C. J. Stone, Introduction to Statistical Theory, Universal Book Stall, New Delhi, 1994", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4014, "Department": "Biosciences & Bioengineering", "Code": "BB 701", "Title": "Research Proposal", "TotalCredits": "10", "Description": "Under the course Research Proposal the student is expected to work independently to generate a comprehensive research proposal of industrial or academic importance, based on extensive literature search and consultations with the research supervisor and p ossible other experts. The proposal is to be compiled as a dissertation whose evaluation would include a seminar and oral defence before a panel of examiners. The grading would take into cognizance originality, innovativeness and feasibilty of the proposa l. The objective is to harness innovative ideas from fresh minds.", "Prerequisite": null, "TextReference": null, "LastUpdate": null, "Structure": {"Type": "S", "Lecture": "0", "Tutorial": "10", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 4015, "Department": "Biosciences & Bioengineering", "Code": "BBS801", "Title": "Seminar", "TotalCredits": "4", "Description": "Ph.D.Seminar", "Prerequisite": null, "TextReference": null, "LastUpdate": null, "Structure": {"Type": "S", "Lecture": "0", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5001, "Department": "Chemical Engineering", "Code": "CL 152", "Title": "Introduction to Chemical Engg.", "TotalCredits": "6", "Description": "Historical overview of Chemical Engineering: Concepts of unit operations and unit processes, and more recent developments, Features of organized chemical processing- from chemistry to chemical engineering. The Chemical Industry-scope, features & characteristics. and scope. Principles of balancing with examples to illustrate differential and integral balances, lumped and distributed balances. Material balances in simple systems involving physical changes and chemical reactions; systems involving recycle, purge. and bypass. Properties of substances: single component & multicomponent, single and multiphase systems. Use of Compressibility charts, vapour pressure correlations/charts & Psychometric charts. Ideal liquid and gaseous mixtures. Energy balance calculations in simple systems. Introduction to Computer aided calculations-steady state material and energy balances.", "Prerequisite": "Nil", "TextReference": "R.M. Felder and R.W. Rousseau, \"Elementary Principles of Chemical Processes\", 3rd ed., J. Wiley, New York, 2000. D.M.Himmelblau, \"Basic Principles and Calculations in Chemical Engineering.\" 6th ed., Prentice Hall of India. New Delhi, 1996. B.I.Bhatt and S.M.Vora, \"Stoichiometry.\" 3rd ed., Tata McGraw Hill. New Delhi. 1996.", "LastUpdate": "04-06-2009", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5002, "Department": "Chemical Engineering", "Code": "CL 310", "Title": "Mass Transfer II", "TotalCredits": "6", "Description": "Perspective on Unit Operations; Liquid-Liquid extraction; Leaching; Adsorption and Ion-exchange; Simultaneous Heat and Mass Transfer: Humidification and Dehumidification, Design of cooling towers, Drying, Crystallization; Membrane processes: Ultra-filtration and reverse osmosis.", "Prerequisite": null, "TextReference": "1. R.E. Treybal, Mass Transfer Operations, 3rd Edition. McGraw Hill. New Delhi. 1983. 2. A.S. Foust, Principles of Unit Operations, 2nd Edition, Wiley, New York. 1980 3. C.J. Geankoplis, Transport Processes and Unit Operations, 3rd Edition. Prentice Hall. India, 1993. 4. W.L. McCabe, J. Smith and P. Harriot, Unit Operations of Chemical Engineering, 5th Edition, Tata McGraw Hill, India, 1993.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5003, "Department": "Chemical Engineering", "Code": "CL 451", "Title": "Chemical Process Design", "TotalCredits": "6", "Description": "Process Design and Development: General Design Considerations; The Hierarchy of Chemical Process Design; The Nature of Process Synthesis and Analysis; Reactor networks in process flowsheets: Attainable region Separation systems in process flowsheets: multicomponent distillation for ideal and non-ideal systems, distillation column sequences, heat integration in distillation columns Heat exchange networks synthesis and utilities: Energy targets Introduction to optimization approaches to optimal design, role of simulations in process design, Design under uncertainty and failure tolerance, Engineering around variations, Introduction to process integration", "Prerequisite": null, "TextReference": "1. J. Douglas, Conceptual Design of Chemical Processes, McGraw Hill, 1989.2. R. Smith, Chemical Process Design, McGraw Hill, New York, 1995.3. D.F. Rudd and C.C. Watson, Strategy of Process Engineering, John Wiley, 1969.4. R.K. Sinnot, An Introduction to Chemical Engineering Design, Pergamon Press, Oxford, 1989.5. L.T. Biegler, E.I. Grossmann, and A.W. Westerberg, Systematic Methods of Chemical Process Design, Prentice Hall International Inc. Series in the Physical and Chemical Engg. Sciences, 1997.6. W.D. Seider and J.D. Seader, Product and Process Design Principles: Synthesis, Analysis and Evaluation, 2nd ed., John Wiley, 2004", "LastUpdate": "02-08-2018", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5004, "Department": "Chemical Engineering", "Code": "CL 613", "Title": "Special Topics in Complex Fluids", "TotalCredits": "6", "Description": "1. Introduction to Statistical Thermodynamics 2. Intermolecular and Surface forces 3. Thermodynamics and Dynamics of Self Assembly 4. Lipids and Biological membranes 5. Mechanics of Cells 6. Polymeric Suspensions 7. Rheology of Complex Fluids 8. Electrohydrodynamics 9. Computational Techniques", "Prerequisite": null, "TextReference": "1. Maurice Kleman, Soft Matter Physics: An Introduction, Springer Verlag 2. Samuel Safran, Statistical Thermodynamics of interfaces, Westview press 3. Reif, 4. Jacob Israelachvili (1992), Intermolecular and Surface Forces, Academic Press. 5. David Boal 6. Ronald Larson (2001), Structure and Rheology of Complex Fluids 7. Rubinstein and Colby (200x), Polymer Physics", "LastUpdate": "27-07-2010", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5005, "Department": "Chemical Engineering", "Code": "CL 651", "Title": "Rheology of Complex Fluids", "TotalCredits": "6", "Description": "The course will largely follow Prof. Ronald Larson’s book titled Structure and Rheology of Complex Fluids. We will begin with an introduction to linear and non-linear viscoelasticity, flow-fields, stresses, etc. Complex fluids such as suspensions, polymer solutions, and soft colloidal glasses will be discussed. Phenomenological models and theories will be presented. Some of the measurement techniques including rheometry, microscopy, etc. will be introduced.", "Prerequisite": "Nil", "TextReference": "Ronald G. Larson, The Structure and Rheology of Complex Fluids, Oxford University Press (1998) Oxford. Ch. W. Macosko, Rheology: Principles, Measurements, and Applications, Wiley-VCH (1994) New York. H. A. Barnes, J. F. Hutton, K. Walters, An Introduction to Rheology, Elsevier (1989) Amsterdam. Morrison, Faith, Understanding Rheology, Oxford University Press (2001). Shaw, M. T.; MacKnight, W. J., Introduction to Polymer Viscoelasticity, 3rd ed.; Wiley: New York, 2005. Bird R. B., Armstrong R. C., Hassager O., Dynamics of Polymeric Liquids, Volume 1. Fluid Mechanics, Wiley-Interscience, New York, 1987. Bird R. B., Armstrong R. C., Hassager O., Dynamics of Polymeric Liquids, Volume 2. Kinetic Theory, Wiley-Interscience, New York, 1987. Richard A.L. Jones, Soft Condensed Matter, Oxford University Press (2002) Oxford.", "LastUpdate": "11-07-2015", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5006, "Department": "Chemical Engineering", "Code": "CL 715", "Title": "Classical Studies in Molecular Biology and Genetics", "TotalCredits": "6", "Description": "• Early studies Mendelian genetics in humans, • One gene, one enzyme hypothesis, • DNA as the transforming principle, • Mutations and fluctuation test, • Structure of DNA and its implications, • Topology and topography of a gene, • Discovery of the genetic code, • Recombination in bacteria, • Principles of gene regulation, • Role of noise in dictating cellular physiology.", "Prerequisite": null, "TextReference": "Books. • J. Monod, A. Ullmann, Selected Papers in Molecular Biology, Academic Press, 2012 (ISBN-10: 9780124604827, ISBN-13: 978-0124604827) • A. H. Sturtevant, A History of Genetics, Cold Spring Harbor Laboratory Press, 2001 (ISBN 978-087969607-8) Journal Articles. 1. Avery, O.T., Macleod, C.M. & McCarty, M. Studies on the Chemical Nature of the Substance Inducing Transformation of Pneumococcal Types : Induction of Transformation by a Desoxyribonucleic Acid Fraction Isolated from Pneumococcus Type Iii. J Exp Med 79, 137-158 (1944). 2. Beadle, G.W. & Tatum, E.L. Genetic Control of Biochemical Reactions in Neurospora. Proc Natl Acad Sci U S A 27, 499-506 (1941). 3. Belin, D. Why are suppressors of amber mutations so frequent among Escherichia coli K12 strains?. A plausible explanation for a long-lasting puzzle. Genetics 165, 455-456 (2003). 4. Benzer, S. Fine Structure of a Genetic Region in Bacteriophage. Proc Natl Acad Sci U S A 41, 344-354 (1955). 5. Benzer, S. On the Topology of the Genetic Fine Structure. Proc Natl Acad Sci U S A 45, 1607-1620 (1959). 6. Benzer, S. On the Topography of the Genetic Fine Structure. Proc Natl Acad Sci U S A 47, 403-415 (1961). 7. Benzer, S. & Champe, S.P. A change from nonsense to sense in the genetic code. Proc Natl Acad Sci U S A 48, 1114-1121 (1962). 8. Bertani, G. Studies on lysogenesis. I. The mode of phage liberation by lysogenic Escherichia coli. J Bacteriol 62, 293-300 (1951). 9. Brenner, S., Stretton, A.O. & Kaplan, S. Genetic code: the `nonsense` triplets for chain termination and their suppression. Nature 206, 994-998 (1965). 10. Casjens, S., Eppler, K., Sampson, L., Parr, R. & Wyckoff, E. Fine structure genetic and physical map of the gene 3 to 10 region of the bacteriophage P22 chromosome. Genetics 127, 637-647 (1991). 11. Champe, S.P. & Benzer, S. An active cistron fragment. J Mol Biol 4, 288-292 (1962). 12. Crick, F.H., Barnett, L., Brenner, S. & Watts-Tobin, R.J. General nature of the genetic code for proteins. Nature 192, 1227-1232 (1961). 13. Edgar, R.S. & Wood, W.B. Morphogenesis of bacteriophage T4 in extracts of mutant-infected cells. Proc Natl Acad Sci U S A 55, 498-505 (1966). 14. Eisen, H., Brachet, P., Pereira da Silva, L. & Jacob, F. Regulation of repressor expression in lambda. Proc Natl Acad Sci U S A 66, 855-862 (1970). 15. Englesberg, E., Irr, J., Power, J. & Lee, N. Positive control of enzyme synthesis by gene C in the L-arabinose system. J Bacteriol 90, 946-957 (1965). 16. Garrod, A.E. The incidence of alkaptonuria: a study in chemical individuality. 1902. Mol Med 2, 274-282 (1996). 17. Griffith, F. The Significance of Pneumococcal Types. J Hyg (Lond) 27, 113-159 (1928). 18. Jacob, F. & Monod, J. Genetic regulatory mechanisms in the synthesis of proteins. J Mol Biol 3, 318-356 (1961). 19. Johnston, M. Joshua Lederberg on Bacterial Recombination. Genetics 203, 613-614 (2016). 20. Kaiser, A.D. Mutations in a temperate bacteriophage affecting its ability to lysogenize Escherichia coli. Virology 3, 42-61 (1957). 21. Luria, S.E. & Delbruck, M. Mutations of Bacteria from Virus Sensitivity to Virus Resistance. Genetics 28, 491-511 (1943). 22. Newcombe, H.B. Origin of bacterial variants. Nature 164, 150 (1949). 23. Tatum, E.L. & Lederberg, J. Gene Recombination in the Bacterium Escherichia coli. J Bacteriol 53, 673-684 (1947). 24. Watson, J.D. & Crick, F.H. Molecular structure of nucleic acids: a structure for deoxyribose nucleic acid. J.D. Watson and F.H.C. Crick. Published in Nature, number 4356 April 25, 1953. Nature 248, 765 (1974).", "LastUpdate": "26-07-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5007, "Department": "Chemical Engineering", "Code": "CL 716", "Title": "Modelling Chemical and Biiological Patterns", "TotalCredits": "6", "Description": "Temporal patterns in chemical and biological systems – Introduction to temporally oscillating chemical and biological systems. Examples from chemistry such as CIDMA, Brusselator, B-Z reactions. Examples from biology such as circadian rhythms. Experimental observations and measurements. Modeling and some analytical solutions to ODEs. Spatio-temporal pattern formation and analytical solutions – Introduction to spatial pattern formation in chemical and biological systems. Reaction-diffusion systems. BZ- reactions, Turing patterns. Spatial patterns in reaction – diffusion-advection systems. Stationary and travelling waves. Modeling of spatio-temporal patterns. Some analytical solutions to PDEs. Computer simulation of spatio-temporal dynamics – Numerical solutions to PDEs. Simulating the evolution of spatio-temporal patterns in chemical and biological systems.", "Prerequisite": null, "TextReference": "Pattern formation and dynamics in non-equilibrium systems, Michael Cross and Henry Greenside, Cambridge University Press 2009 Pattern formation: An introduction to methods, Rebecca Hoyle, Cambridge University Press 2006 Non-linear partial differential equations for scientists and engineers, Lokenath Debnath, Birkhauser 1997 An introduction to nonlinear chemical dynamic: Oscillations, waves, patterns and chaos, Irving R Epstein and R Pojman Dynamics of Patterns, M I Rabinovich; A B Ezersky; Patrick D Weidman, World Scientific 2000", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5008, "Department": "Chemical Engineering", "Code": "CL 717", "Title": "Evolutionary Dynamics", "TotalCredits": "6", "Description": "Introduction to Evolution; Fitness Landscape and Sequence Spaces; Evolutionary Game Theory (fitness dependent on frequency);Origin of Cooperation (genes to genomes; single-cell to multicellular organisms); Deterministic and Stochastic Description of Finite Populations; Evolutionary Graph Theory; Infinite Populations; Modeling Ecological Dynamics; &Examples: Evolution of Cancer, HIV, Virulence, and Language.", "Prerequisite": null, "TextReference": "Matrin Nowak, Evolutionary Dynamics, Belknap Press (2009);Sean H. Rice, Evolutionary Theory: Mathematical and Conceptual Foundations, Sinauer Associates (2004)Karl Sigmund, The Calculus of Selfishness, Princeton University Press (2010);Josef Hofbauer and Karl Sigmund, Evolutionary Games and Population Dynamics, Cambridge University Press (1998);John Maynard Smith and Eros Szathmary, The Major Transitions in Evolution, W. H. Freeman & Co. (1995)", "LastUpdate": "23-07-2015", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 5009, "Department": "Chemical Engineering", "Code": "CL 718", "Title": "Introduction to Cell Mechanics", "TotalCredits": "6", "Description": "Review of cell biology in general; shape, size and function. Introduction to intracellular structures and their functions: membrane, cytoplasm, cytoskeletal elements and nucleus. Introduction to Cell mechanics and its importance in biology under normal and pathological conditions. Review of rheology and surface tension. Cell membrane: description of bi-layer structure, membrane tension, Laplace’s equation, micro-aspiration technique and related calculations. Cytoskeletal elements: Structure of actin, microtubule, molecular motors, related mechanisms. Review of stress-strain and solid mechanics. Cellular rheology and associated experimental methods; AFM, optical tweezers. Effect of cell mechanics on cellular functions. Cell types covered; stem cells, RBC and cardiomyocytes. Cell response to flow and strain. Cell migration, single and collective. Introduction to micro-fabrication and lithography. Micro-contact printing. Methods to measure cellular contractility; wrinkle on substrate, traction force microscopy, micro pillars and associated calculation. Mechanism of mechanotransduction; ion-channel, stretchy proteins, molecular pathways. Tensegrity model and nuclear deformation. Diseases caused by problems in cellular/nuclear mechanics.", "Prerequisite": null, "TextReference": "D. Boal, Mechanics of the Cell, Cambridge University Press. YL. Wang and D. Discher, Methods in Cell Biology (Vol 83), Elsevier, 2007. A. Gefen, Cellular and Biomolecular Mechanics and Mechanobiology, Springer 2011. A.Wagoner Jhonson and B. Harley(Ed.), Mechanobiology of cell-cell and cell-matrix interactions, Springer 2011. C. Jackobs, H. Huang and R. Kwon, Introduction to Cell Mechanics and Mechanobiology, Garland Science 2012.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 6001, "Department": "Chemistry", "Code": "CH 104", "Title": "Chemistry II", "TotalCredits": "6", "Description": null, "Prerequisite": "Nil", "TextReference": null, "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 6002, "Department": "Chemistry", "Code": "CH 410", "Title": "Bio-Inorganic Chemistry", "TotalCredits": "6", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": "30-11-2016", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 6003, "Department": "Chemistry", "Code": "CH 591", "Title": "Research Project I", "TotalCredits": "6", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": "29-04-2016", "Structure": {"Type": "P", "Lecture": "0", "Tutorial": "4", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 6004, "Department": "Chemistry", "Code": "CH 814", "Title": "Fundamentals of Molecular Energetics and Dynamics", "TotalCredits": "6", "Description": "Statistical view of entropy; Deducing 2nd and 3rd laws of thermodynamics from statistical considerations; Free energies, chemical potentials, partial molar quantities; Boltzmann distribution, patition functions and statistical mechanics of simple gases and solids; Chemical equilibrium and equilibrium constant interms of partition functions; physical kinetics; reaction dynamics, transition states; ions in solution; cooperativity.", "Prerequisite": null, "TextReference": "(1) Dill K. A.; Bromberg S. Molecular Driving Forces: Statistical Thermodynamics in Chemistry and Biology, 2003, Garland Science, New York and London (2) Hanson, R. M.; Green, S. Introduction to Molecular Thermodynamics 2008, University Science Books, Sansalito, California", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 6005, "Department": "Chemistry", "Code": "CHS801", "Title": "Seminar", "TotalCredits": "4", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": "03-04-2003", "Structure": {"Type": "S", "Lecture": "0", "Tutorial": "0", "Practical": "4", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 7001, "Department": "Civil Engineering", "Code": "CE 102", "Title": "Engineering Mechanics", "TotalCredits": "6", "Description": "Equivalent Force Systems: Basic concepts of force-couple systems. planar firce systems: parallel force systems; simplest equivalent for general force system- \"wrench\". distributed force systems.Equations of Statics and its Applications: Simple frictionless rigid body assemblies; two foce members: machines: trusses: cables: rigid body assemblies including friction.Virtual Work and Potential Energy Principles: Application of these principles as replacement of equations of statics for real life problems.Vibrations: Equations of motion for single degree-of-freedom systems and rigid body assemblies: free vibration (simple harmonic oscillator): concepts of dampling and cirtical damping: damped free vibration: equations of motion for harmonic excitation: transient and steady-state vibrations: illustration of MDOF systems concepts with two degree-of-freedom systems.", "Prerequisite": null, "TextReference": "I.H. Shames, \"Introduction to Solid Mechanics, Second Edition, Prentice Hall of India, New Delhi, 1989.F.P. Beer and Jhonston, \"Mechanics for Engineers\", McGraw Hill, New Delhi, 1987.", "LastUpdate": "14-06-2018", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 7002, "Department": "Civil Engineering", "Code": "CE 610", "Title": "Introduction to Earthquake Engineering", "TotalCredits": "6", "Description": "Characterisation of ground motion, Earthquake intensity and magnitude; Recording instruments and base line correction; Predominant period and amplification through soil; Earthquake spectra for elastic and inelastic systems; Idealisation of structural systems for low, medium and high rise buildings; Lateral force evaluation by mode superposition and direct integration; Reserve energy technique; Effect of foundation/soil on earthquake response; Analysis for torsion; Review of damages during past earthquakes and remedial measures; Reinforcement detailing for members and joints coupling; Codal provisions.", "Prerequisite": null, "TextReference": "A. K. Chopra, Dynamics of Structures ? Applications to Earthquake Engineering, Prentice-Hall, New York, 1995. R.W. Clough and J. Penzien, Dynamics of Structures, 2nd edition, McGraw-Hill, New York, 1992. N.M. Newmark and E. Rosenblueth, Fundamentals of Earthquake Engineering, Prentice Hall, New York, 1971. D. Key, Earthquake Design Practice for Building, Thomas Telford, London, 1988. R.L. Wiegel, Earthquake Engineering, 2nd edition, Prentice Hall, London, 1989. J.A. Blume, N.M. Newmark, and L.H. Corning, Design of Multi-storied Buildings for Earthquake Ground Motions?, Portland Cement Association, Chicago, 1961. Proceedings of World Conferences on Earthquake Engineering, 1956-2000. I.S. Codes No.1893, 4326,13920.", "LastUpdate": "21-07-2003", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 7003, "Department": "Civil Engineering", "Code": "CE 651", "Title": "Bridge Engineering", "TotalCredits": "6", "Description": "1. Historical evolution of bridges and classification 2. Design principles for superstructure and substructure. Introduction to codes. Design of slab bridges, steel girder bridges and prestressed concrete bridges 3. Introduction to bridge design softwares", "Prerequisite": null, "TextReference": "1. D. Johnson Victor, \"Essentials of Bridge Engineering\", Oxford &IBH Publishing Company Pvt. Ltd. 2. Richard M. Barker &Jay A. Puckett, \"Design of Highway Bridges : An LRFD Approach\", Wiley Publications.", "LastUpdate": "26-10-2015", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 7004, "Department": "Civil Engineering", "Code": "CE 710", "Title": "Remote Sensing and Geographical Information Systems in Water Resources Management", "TotalCredits": "6", "Description": "Various components of hydrological cycle 302226 Basic concepts of hydrological modelling 302226 Physics of remote sensing 302226EMR Interaction with atmosphere and earth surface (soil, water, and vegetation) 302226 Remote sensing platforms 302226 Satellite data analysis 302226 Basic principles of GIS 302226 Spatial analysis related to water resources 302226 Remote sensing and GIS data sources for water resources 302226 Case studies of remote sensing and GIS applications for various water resources projects.", "Prerequisite": null, "TextReference": "1.Chen, Y., Takara, K., Cluckie, I. and Smedt, F.H. (Eds.), 302223GIS and Remote sensing in Hydrology, Water resource and Environment302224, IAHS Publication 289, IAHS press. 2004.2.Burrough P.A. and McDonnell R.A., 302223Principles of Geographical Information Systems302224, Oxford University Press, New York, 1998.3.David Maidment and Dean Djokic, 302223Hydrologic and Hydraulic Modelling Support with GIS302224, ESRI Press, 2000.4.Lillesand, T.M. and Kiefer, R.W., 302223Remote Sensing and Image Interpretation302224, 6th Edition, John Wiley and Sons, New York. 2010.", "LastUpdate": "06-02-2013", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "2", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 7005, "Department": "Civil Engineering", "Code": "CE 718", "Title": "Construction Materials Laboratory", "TotalCredits": "4", "Description": "Experiment No. Name of the Experiment Laboratory 1 Bricks/Blocks, Tiles - Strength and Water Absorption SEMT Lab. 2 Mineral Admixtures – Particle size and Shape Analysis CMMC Lab. 3 Chemical Admixture (Superplasticiser) optimisation - Mini Slump and Marsh Cone) SEMT Lab. 4 Concrete - Slump, Slump retention, Setting Time SEMT Lab. 5 Concrete - Strength (Normal Curing & Steam Curing) SEMT Lab. 6 Concrete - Non Destructive Test (Rebound Hammer & UPV Test) SEMT Lab. 7 Concrete - Carbonation Test, Water Permeability Test SEMT Lab. 8 Concrete - Porosity (MIP) CMMC Lab. 9 Concrete - Abrasion Resistance SEMT Lab. 10 Steel (HYSD bars) - Tension Test HS Lab.", "Prerequisite": null, "TextReference": "IS 3495 (1992) Methods of tests of burnt clay building bricks. Part 1 determination of compressive strength. Part 2 determination of water absorption, Bureau of Indian Standards, New Delhi. IS 13630 (2006) Ceramic tiles – Methods of Test. Part 2 Determination of water absorption. Part 6 Determination of modulus of rupture, Bureau of Indian Standards, New Delhi. IS 1786 (1990) Specification for high strength deformed steel bars and wires for concrete Reinforcement, Bureau of Indian Standards, New Delhi. IS 9103 (2004) Concrete admixtures - Specification, Bureau of Indian Standards, New Delhi. IS 10262 (2004) Recommended guidelines for concrete mix design, Bureau of Indian Standards, New Delhi. IS 13311 (2004) Non-destructive testing of concrete - Methods of test. Part 1 ultrasonic pulse velocity. Part 2 rebound hammer, Bureau of Indian Standards, New Delhi. IS 1199 (1999) Methods of sampling and analysis of concrete, Bureau of Indian Standards, New Delhi. IS 8142 (2002) Method of test for determining setting time of concrete by penetration resistance, Bureau of Indian Standards, New Delhi. IS 516 (1997) Method of test for strength of concrete, Bureau of Indian Standards, New Delhi. IS 3085 (1997) Method of test for permeability of cement mortar and concrete, Bureau of Indian Standards, New Delhi. Nanthagopalan, P and Santhanam, M (2008) A new approach to optimisation of paste composition in self-compacting concrete, The Indian Concrete Journal, vol. 82, 11 - 18. de Larrard, F., F. Bosc, C. Catherine, and F. Deflorenne (1997) The AFREM method for the mix-design of high performance concrete. Materials and Structures, 30, 439 - 446.", "LastUpdate": "12-04-2016", "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "0", "Practical": "4", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 7006, "Department": "Civil Engineering", "Code": "CE 719", "Title": "Construction Contracts", "TotalCredits": "6", "Description": "Comprehensive study of different types of contracts and their working. Important clauses in the contracts. Standard forms of contracts used in India and abroad. Owner- construction contractor prime contract, labor agreements; purchase order and subcontract agreements; insurance contracts; surety bonds; joint-venture agreements; bid and proposals; mistakes in bids; breach of contract; contract changes; differing site conditions; delays, suspensions, and terminations; liquidated damages, force majeure, and time extensions; allocating responsibility for delays; constructive acceleration; common rules of contract interpretation; Problems in the operation of contracts, Enforcement of contracts, Incentive mechanism in contracts. Claims and disputes, Claim process, Dispute resolutions, Arbitrations settlements, Litigations on contracts, Case studies on arbitration and litigations in contracts. Professional practice ethics, duties and responsibilities of project managers in construction projects Construction specifications - standard specifications, development, interpretation.", "Prerequisite": null, "TextReference": "Bartholomew, Stuart H. Construction contracting: Business and legal principles. 2nd ed. Prentice Hall, 2001. Hughes,W., Champion, R. and Murdoch, J., Construction Contracts – Law and Management. 5th ed. Routeledge, Taylor and Francis, 2015. Hinze, J., Construction contracts. 3rd edition, McGraw-Hill Science Publishers, 2000. Central Public Works Department, General Conditions of Contract and The Arbitration and Conciliation Act, 1996 Case studies on contracts", "LastUpdate": "12-04-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8001, "Department": "Computer Science and Engineering", "Code": "CS 101", "Title": "Computer Programming and Utilization", "TotalCredits": "6", "Description": "This course provides an introduction to problem solving with computers using a modern language such as Java or C/C++. Topics covered will include :* Utilization : Developer fundamentals such as editor, integrated programming environment, Unix shell, modules, libraries.* Programming features : Machine representation, primitive types,arrays and records, objects, expressions, control statements, iteration,procedures, functions, and basic i/o.* Applications : Sample problems in engineering, science, text processing, and numerical methods.", "Prerequisite": null, "TextReference": "* C++ Program Design: An introduction to Programming and Object-Oriented Design, 3rd Edition, by Cohoon and Davidson, Tata McGraw Hill. 2003.Other references (Not required reading)* Thinking in C++ 2nd Edition by Bruce Eckel(available online)* G. Dromey, How to Solve It by Computer, Prentice-Hall, Inc., Upper Saddle River, NJ, 1982.* Polya, G., How to Solve _It (2nd ed.), Doubleday and co. (1957).* Let Us C. Yashwant Kanetkar. Allied Publishers, 1998.* The Java Tutorial, Sun Microsystems. Addison-Wesley, 1999.", "LastUpdate": "02-07-2018", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "2", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8002, "Department": "Computer Science and Engineering", "Code": "CS 152", "Title": "Abstractions and Paradigms for Programming", "TotalCredits": "6", "Description": "Review of the program development process, Issues in program design, Structured programming, Data and control abstractions, Programming with assertions. Reasoning about programs and proving correctness of programs. Ideas behind imperative, applicative, object oriented and logic programming paradigms such as typing, expressions, pure functions, recursion, higher order functions, encapsulation, inheritance, goal satisfaction, backtracking, unification. Some of the ideas behind the implementation of the paradigms. Course to be centered around problems and applications that demonstrate the main themes.", "Prerequisite": null, "TextReference": "Harold Abelson, Gerald Jay Sussman and July Sussman, Structure and Interpretation of Computer Programs, 2nd edition, The MIT Press, 1996. David A. Watt, Programming Language Concepts and Paradigms, Prentice-Hall, 1990. Rajeev Sangal, Programming Paradigms in Lisp, McGraw Hill, 1991.", "LastUpdate": "29-12-2004", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8003, "Department": "Computer Science and Engineering", "Code": "CS 154", "Title": "Programming Paradigms Laboratory", "TotalCredits": "3", "Description": "Programming assignments that illustrate concepts from the course CS 152.", "Prerequisite": null, "TextReference": null, "LastUpdate": "23-03-2011", "Structure": {"Type": "L", "Lecture": "1.5", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8004, "Department": "Computer Science and Engineering", "Code": "CS 213", "Title": "Data Structures and Algorithms", "TotalCredits": "6", "Description": "Introduction to data structures, abstract data types, analysis of algorithms. Creation and manipulation of data structures: arrays, lists, stacks, queues, trees, heaps, hash tables, balanced trees, tries, graphs. Algorithms for sorting and searching, order statistics, depth-first and breadth-first search, shortest paths and minimum spanning tree.", "Prerequisite": null, "TextReference": "1. T. Cormen, C. Leiserson, R. Rivest, C. Stein, Introduction to Algorithms, 2nd edition, Prentice-Hall India, 2001. 2. S. Sahni, Data Structures, Algorithms and Applications in C++,2nd edition, Universities Press,2005.", "LastUpdate": "06-01-2010", "Structure": {"Type": "T", "Lecture": "8", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8005, "Department": "Computer Science and Engineering", "Code": "CS 218", "Title": "Design and Analysis of Algorithms", "TotalCredits": "6", "Description": "Models of computation, algorithm analysis, time and space complexity, average and worst case analysis, lower bounds. Algorithm design techniques: divide and conquer, greedy, dynamic programming, amortization, randomization. Problem classes P, NP, PSPACE; reducibility, NP-hard and NP-complete problems. Approximation algorithms for some NP-hard problems.", "Prerequisite": "Nil", "TextReference": "1. T.H.Cormen, C.E.Leiserson, R.L.Rivest, C. Stein, Introduction to Algorithms, 2nd edition, Prentice-Hall India, 2001. 2. J. Kleinberg and E. Tardos, Algorithm Design, Pearson International Edition, 2005.", "LastUpdate": "02-02-2012", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8006, "Department": "Computer Science and Engineering", "Code": "CS 310", "Title": "Automata Theory", "TotalCredits": "6", "Description": "Finite state machines (DFA/NFA/epsilon NFAs), regular expressions. Properties of regular languages. My hill-Nerode Theorem. Non-regularity. Push down automata. Properties of context-free languages. Turing machines:Turing hypothesis, Turing computability, Nondeterministic, multi tape and other versions of Turing machines. Church`s thesis, recursively enumerable sets and Turing computability. Universal Turing machines. Unsolvability, The halting problem, partial solvability, Turing enumerability, acceptability and decidability, unsolvable problems about Turing Machines. Post`s correspondence problem.", "Prerequisite": null, "TextReference": "1.Introduction to Automata Theory, Languages and Computation, by John. E. Hopcroft, Rajeev Motwani, J. D. Ullman, published by Pearson Education Asia, 2006. Full 2.Elements of the Theory of Computation, by H.R. Lewis and C.H.Papadimitrou, published by Prentice Hall Inc, 1981.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8007, "Department": "Computer Science and Engineering", "Code": "CS 316", "Title": "Implementation of Programming Languages Lab", "TotalCredits": "4", "Description": "Design and implementation of a compiler for a sufficiently rich subset of a real programming language. The compiler will be automatically generated through use of tools such as LEX and YACC.", "Prerequisite": null, "TextReference": null, "LastUpdate": null, "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "1", "Practical": "2", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8008, "Department": "Computer Science and Engineering", "Code": "CS 317", "Title": "Database and Information Systems", "TotalCredits": "6", "Description": "Overview of data management systems. Relational model and query languages (relational algebra and calculus, SQL). Database design using the ER Model, ER Diagrams, UML Class Diagrams. Relational database design and normalization. Integrity and Security. Design and development of Web based information systems. Overview of storage structures and indexing, query processing and optimization, and transaction processing. Introduction to Big Data management concepts such as: distributed and scalable data storage, including distributed file systems, key value stores, column stores and graph databases, replication and consistency, and concurrent data processing using the Map Reduce paradigm. Introduction to decision support and data analysis, data warehousing and data mining, and Information Retrieval.", "Prerequisite": null, "TextReference": "Abraham Silberschatz, Henry F. Korth and S. Sudarshan, Database System Concepts 6th Ed, McGraw Hill, 2010.", "LastUpdate": "01-12-2015", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8009, "Department": "Computer Science and Engineering", "Code": "CS 416", "Title": "Computer and Network Security", "TotalCredits": "6", "Description": "Vulnerabilities, risks, attacks, defences, forensics. Examples and applications of Public Key Cryptography and Secret Key Cryptography. Crypto hash, digital signatures, digital certificates and PKI. Basic Authentication and Key Agreement protocols, SSL/TLS and Kerberos. Vulnerabilities and attacks on TCP, DNS, ARP, etc. and DDoS attacks. Network/host intelligence gathering and reconnaissance methods. Web security – SQL injection, XSS, etc. Software security and buffer overflow. Malware types and case studies. Access Control, firewalls and host/network intrusion detection.", "Prerequisite": null, "TextReference": "1. Menezes, Bernard. Network Security And Cryptography, 1st ed., Cengage Learning India, 2010 2. Stallings, William. Cryptography And Network Security, Fourth Edition, Pearson, 2006", "LastUpdate": "01-12-2015", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8010, "Department": "Computer Science and Engineering", "Code": "CS 419", "Title": "Introducing to Machine Learning", "TotalCredits": "6", "Description": "This course will provide a broad overview of Machine Learning with a stress on applications. Supervised learning: Decision trees, Nearest neighbor classifiers, Generative classifiers like naive Bayes, Support vector Machines Unsupervised learning: K-Means clustering, Hierarchical clustering, EM, Itemset mining Applications: image recognition, speech recognition, text and web data retrieval, bio-informatics, commercial data mining.", "Prerequisite": "CS 213", "TextReference": "Tom Mitchell, Machine Learning. McGraw-Hill, 1997.     Pattern recognition and machine learning by Christopher Bishop, SPringer Verlag 2006     Selected papers", "LastUpdate": "21-07-2011", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8011, "Department": "Computer Science and Engineering", "Code": "CS 613", "Title": "Design & Implementation of Functional Programming Languages", "TotalCredits": "6", "Description": "Illustration of Basic concepts in FP using Haskell: Functions as first class objects, Laziness, Datatypes and pattern matching, Types, Classes and overloading, Side-effect free IO. Introduction to Lambda Calculus: Syntax of Lambda terms, Alpha, beta and delta conversions, Normal forms, applicative order and normal order reductions, Church-Rosser theorems, Y combinator and recursion. Type Inference: Hindley-Milner type checking algorithm and its extension to handle type classes. Implementation of FP Languages: Supercombinators and Lambda Lifting, Graph reduction, Three instruction machine (TIM). Selected topics in Functional Programming: Bird-Meertens Formalism, Abstract Interpretation, Functional Programming using Monads. Selected topics in Functional Programming: Bird-Meertens Formalism, Abstract Interpretation, Functional Programming using Monads.", "Prerequisite": "NIL", "TextReference": "P. Hudak, S. Peyton Jones and P. Wadler (eds), Report on the Programming Language Haskell, A Non-strict Purely Functional Language (v 1.2), ACM SIGPLAN Notices, 21(12):37-79, December 1986. P. Hudak and J. Fasel. A Gentle Introduction to Haskell. ACM SIGPLAN Notices, 21(12):37-79, December 1986. R. Bird and P. Wadler. Introduction to Functional Programming, Prentice Hall, New York, 1988. J. R. Hindley and J. P. Seldin. Introduction to Lambda Calculus and Combinators. Cambridge University Press, 1984. S. Peyton Jones. The Implementation of Functional Programming languages, Prentice Hall, New York, 1987. G. Argo, Improving the Three Instruction Machine, Procs. of FPCA, ACM Press, 1989.", "LastUpdate": "17-11-2006", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8012, "Department": "Computer Science and Engineering", "Code": "CS 621", "Title": "Artificial Intelligence", "TotalCredits": "6", "Description": "Prerequisites: Undergraduate Course on Artificial Intelligence Knowledge Representation: The First Order Predicate Logic, Production Systems, Semantic Nets, Frames and Scripts Formalisms. Resolution in Predicate Logic, Unification, Strategies for Resolution by Refutation. Knowledge Acquisition and learning: Learning from examples and analogy, Rote learning, Neural Learning, Integrated Approach. Planning and Robotics: STRIPS, ABSTRIPS, NOAH and MOLGEN planners, preliminary ideas of distributed and real time planning, Subsumption architecture based planning. Expert Systems: fundamental blocks, case studies in various domains, concept of shells, connectionist expert systems. Introduction to Natural Language Understanding: problems of ambiguity, ellipsis and polysemy, lexicalization and parsing, Transition and Augumented Transition networks, Natural Language Interfaces. Introdution to Computer Vision: Edge detection, Point Correspondence and Stereopsis, Surface directions. Basics of Neural Networks: Perceptrons, Feedforward nets Backpropagation algorithm, preliminary understanding of unsupervised learning.", "Prerequisite": null, "TextReference": "E. Charniak, et.al., Introduction to Artificial Intelligence, Addison Wesley, 1985. P. H. Winston, Artificial Intelligence, Addison Wesley, 1993. E. Rich and K. Knight, Artificial Intelligence, Addison Wesley, 1990. R. Honavar and E. Uhr, Artificial Intelligence and Neural Networks, Academic Press, 1992. F. Hayes Roth et.al., Building Expert Systems, Addison Wesley, 1983. P. R. Cohen,et.al., The Handbook of Artificial Intelligence, Vol.1,2 and 3, Kaufman Inc.,1982. B. K. P. Horn, Robot Vision, MIT Press, 1985. J. Carbonell, Machine Learning paradigms and Methods, MIT Press, 1990.", "LastUpdate": "17-03-2005", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8013, "Department": "Computer Science and Engineering", "Code": "CS 681", "Title": "Performance Analysis of Computer Systems and Network", "TotalCredits": "6", "Description": "Performance measures of computing and networking systems; open and closed loop load testing and performance measurement; performance modeling using Markovian queuing systems (M/M/c/k), asymptotic analysis of queues, basic queuing system laws: Utilization Law, Little’s Law; non-Markovian queues (M/G/1), open and closed queueing networks; design, implementation and statistical analysis of discrete event simulation models; application of data driven models for performance prediction: (machine learning models- e.g. support vector regression, clustering based models, Bayesian optimization, neural network models). Case studies and applications of these methods through paper-readings and projects in a spectrum of distributed and networked systems --- e.g., web systems, virtualization platforms, clouds, distributed data processing platforms and learning systems, distributed applications, networking protocols, network backbone architectures, etc", "Prerequisite": "MA 212", "TextReference": "Harchol-Balter, Mor. Performance Modeling andDesign of Computer Systems: Queueing Theory inAction. Cambridge University Press, 2013.2. Queueing Systems vol I & II, by L. Kleinrock,John Wiley and Sons, 1975.5. Averill, M. \"Law. Simulation modeling andanalysis.\" Tata McGraw-Hill (2007). Averill, M. \"Law. Simulation modeling and analysis.\" Tata McGraw-Hill (2007). Representative Papers: 1. Chiang, R. C., Hwang, J., Huang, H. H., & Wood, T. Matrix: Achieving predictable virtual machine performance in the clouds. In 11th International Conference on Autonomic Computing ({ICAC} 14) (pp. 45-56). 2014.2. Kundu, Sajib, Raju Rangaswami, Ajay Gulati, Ming Zhao, and Kaushik Dutta. \"Modeling virtualized applications using machine learning techniques.\" In Proceedings of the 8th ACM SIGPLAN/SIGOPS conference on Virtual Execution Environments , pp. 3-14. 2012. 3. E. Vianna, G. Comarela, T. Pontes, J. Almeida, V. Almeida, K. Wilkinson, H. Kuno, and U. Dayal. Analytical performance models for MapReduce workloads. International Journal of Parallel Programming, 41(4):495{525, 2013. 4. Alipourfard, O., Liu, H. H., Chen, J., Venkataraman, S., Yu, M., & Zhang, M. (2017). Cherrypick: Adaptively unearthing the best cloud configurations for big data analytics. In 14th {USENIX} Symposium on Networked Systems Design and Implementation ({NSDI} 17) (pp. 469-482). 5. Venkataraman, S., Yang, Z., Franklin, M., Recht, B., & Stoica, I. (2016). Ernest: Efficient performance prediction for large-scale advanced analytics. In 13th {USENIX} Symposium on Networked Systems Design and Implementation ({NSDI} 16) (pp. 363-378) 6. Peng, Y., Bao, Y., Chen, Y., Wu, C., & Guo, C. (2018, April). Optimus: an efficient dynamic resource scheduler for deep learning clusters. In Proceedings of the Thirteenth EuroSys Conference (pp. 1-14). 7. Mathew, A., Srinivasan, M., & Murthy, C. S. R. (2019, September). Packet Generation Schemes and Network Latency Implications in SDN-enabled 5G C-RANs: Queuing Model Based Analysis. In 2019 IEEE 30th Annual International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC) (pp. 1-7). IEEE. 8. E. Balevi and R. D. Gitlin, \"Unsupervised machine learning in 5G networks for low latency communications,\" 2017 IEEE 36th International Performance Computing and Communications Conference (IPCCC) , San Diego, CA, 2017, pp. 1-2, doi: 10.1109/PCCC.2017.8280492. 9. Jo, C., Cho, Y., & Egger, B. (2017, September). A machine learning approach to live migration modeling. In Proceedings of the 2017 Symposium on Cloud Computing (pp. 351-364).", "LastUpdate": "16-10-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8014, "Department": "Computer Science and Engineering", "Code": "CS 719", "Title": "Topics in Mathematical Foundations of Formal Verifications", "TotalCredits": "6", "Description": "Order and lattice theory:Ordered sets: definitions, diagrammatic representations,down-sets, up-sets, maps between ordered setsLattices: definitions, sublattices, products, homomorphisms,ideals and filters, complete lattices, chain conditions andcompleteness, join-irreducible elements,Distributive and Boolean lattices: definitions, M3−N5theorem, Boolean lattices and Boolean algebras, results forfinite distributive and finite Boolean latticesComplete lattices, closure operators, Galois connections andcompletions, CPOs and fixpoint theoremsWell-quasi orders and better-quasi orders, Higman302222s Lemmaand applicationsFirst-order Logic:Quick recap of syntax, semantics, normal forms, decidabilityissues, completeness.Compactness of first-order logic and its applications, Craig302222sinterpolation theorem, Beth302222s definability theoremStructures, isomorphism of structures, Skolem- LowenheimtheoremProvability and refutability: Natural deduction, Gentzen302222stheorem, semantic tableaux, Skolemization, refutations ofuniversal sentences, Herbrand302222s theorem, unificationSome decidable fragments of first-order logic and theirdecision procedures: propositional logic, equality withuninterpreted functions, linear arithmetic, Presburger logic ,bit vectors, arrays, pointer logic.Decision procedures for combinations of first-order theories:Nelson-Oppen, Shostak, Satisfiability Modulo Theories(SMT)Type theory:Typed lambda calculus and its extensions: dependentfunction spaces, Cartesian products, dependent products,disjoint union, integers, atoms, lists.Equality and propositions as typesSubtypes and quotient typesSemantics: Computation system, type system, judgementforms", "Prerequisite": "0", "TextReference": "1. Introduction to Lattices and Orders, B. A. Davey andH. A. Priestley, Cambridge University Press, 20022. A First Course in Logic: An Introduction to ModelTheory, Proof Theory, Computability and Complexity,Shawn Hedman, Oxford Texts in Logic, OxfordUniversity, 20043. Decision Procedures: An Algorithmic Point of View,D. Kroening and O. Strichman, Springer, 20084. An Introduction to Mathematical Logic and TypeTheory: To Truth Through Proof, Peter B. Andrews,Springer, 20025. Types and Programming Languages, Benjamin C.Pierce, The MIT Press, 20026. Introduction to Type Theory in The Nuprl Book,Cornell University, 1995(http://www.cs.cornell.edu/info/projects/nuprl/book/doc.html)7.", "LastUpdate": "30-06-2015", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 8015, "Department": "Computer Science and Engineering", "Code": "CS 741", "Title": "Advanced Network Security and Cryptography", "TotalCredits": "6", "Description": "Math background for cryptography, Elliptic Curve Cryptography (ECC), optimization techniques for ECC. Side channel attacks on AES and DSA. Attacks on factorization and the discrete logarithm. SSL vs. IPSec. WLAN and cellphone security protocols. FMS attack on WEP. Web security – advanced attacks and defences. Botnets – design and detection. Cloud security issues – data auditing, homomorphic encryption, etc. Electronic payment and currencies (ex. Bitcoins).", "Prerequisite": null, "TextReference": "Darrel Hankerson, Alfred J Menezes & Scott Vanstone, Guide to Elliptic Curve Cryptography, Springer Professional Computing, 2004 Menezes, Bernard. Network Security And Cryptography, 1st ed., Cengage Learning India, 2010 (ISBN9788131513491) Relevant RFCs, standards and research papers.", "LastUpdate": "30-06-2015", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}]