[{"id": 9001, "Department": "Earth Sciences", "Code": "GP 414", "Title": "Electrical Methods", "TotalCredits": "4", "Description": "Electrical properties of rocks; Introduction to Electrical methods of geophysical prospecting, Principles of Resistivity methods, Instruments for Resistivity methods; Resistivity field surveys in different array configurations (Wenner, Schlumberger, dipole-dipole, pole-pole, pole-dipole), Profiling and Sounding techniques, Resistivity imaging, Resistivity Data analysis and Interpretation; Induced Polarization and Self-potential methods, Concepts of groundwater accumulation, geology of groundwater occurrence, types of aquifers and their characteristics, resistivity methods for groundwater exploration and some case histories.", "Prerequisite": null, "TextReference": "1.W.M. Telford, L.P.Geldart, and R.E.Sheriff, Applied geophysics, Cambridge, 1990. 2.M.B.Dobrin, and C.H. Savit, Introduction to geophysical prospecting, McGraw Hill, 1988.3. G. V. Keller, Electrical Methods of Geophysical Prospecting, Pergamon Press, 1980.4. Fetter, C.W., 2001. Applied Hydrogeology, Fourth ed. Prentice Hall, NJ, USA.", "LastUpdate": "23-04-2013", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9002, "Department": "Earth Sciences", "Code": "GP 415", "Title": "Mineralogy & Petrology Lab", "TotalCredits": "3", "Description": "Identification of rock forming minerals, megascopic and microscopic study. X-ray diffraction, Identification and classification of rocks, textures and mineral compositions of igneous, sedimentary and metamorphic rocks.", "Prerequisite": null, "TextReference": "1. Ness, W.D. Optical Mineralogy. 348p, Oxford University Press, 2004 2. Klein, C. Manual of Mineral Science, 22nd Edition. John Wiley and Sons, 2001. 3. Williams, H., Turner, F.J. and Gilbert, C.M. Petrography: An Introduction to the Study of Rocks in Thin Sections, CBS Publishers and Distributors, 1985.", "LastUpdate": null, "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "0", "Practical": "3", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9003, "Department": "Earth Sciences", "Code": "GP 416", "Title": "Structural Geology & Stratigraphy", "TotalCredits": "6", "Description": "Planes and lines in structural geology, dip, strike, pitch, plunge; principles and applications of stereo-net; folds, faults, joints, foliations, lineations. Introduction to stress and strain, ductile and brittle deformations; modeling rocks as a laminar fluid, Couette- and Poiseuille flow along and across gravity-geoscientific applications. Structure and major tectonic features of the Indian subcontinent. Principles of stratigraphy; stratigraphic classification and correlation. Facies concepts and facies analysis. Stratigraphy, tectonics and geochronology of the Precambrians of India; Palaeozoic and Mesozoic formations of Himalaya and Peninsular India, Gondwana sequence; subsurface geology of Bengal, Assam, Cauvery, Krishna-Godavari, Cambay, Kutch, Rajasthan basins.", "Prerequisite": null, "TextReference": "1.Krishnan, M.S. Geology of India and Burma, CBS Publ. & Distr., 1982. Ravindra Kumar Fundamentals of Historical Geology and Stratigraphy of India, Wiley Eastern. 1985. 2.Naqvi, S.M. Geology and Evolution of the Indian Plate, Capital Publishing Company, 2005. 3. Billings, M.P. Structural Geology. Prentice Hall, 1972 4. Davis, G. H., Reynolds, S.J. Structural Geology of Rocks and Regions, 1996", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9004, "Department": "Earth Sciences", "Code": "GP 418", "Title": "Exploration Seismology I", "TotalCredits": "6", "Description": "Theory and geometry of seismic waves, seismic velocity of rocks, characteristics of seismic events, seismic sources and equipment. seismic reflection and refraction field methods, CDP technique, seismic noise, velocity measurements, marine seismic surveys, data processing - convolution, correlation, filtering, velocity analysis, stacking and migration, synthetic seismograms, seismic interpretation.", "Prerequisite": null, "TextReference": "1. C.L.Liner, Elements of 3D seismology, Pennwell Corporation, U.S., 2004. 2. Sheriff,R.E. and Geldart,L.P. Exploration seismology, Cambridge Univ. Press 1995. 3. W.M. Telford, L.P.Geldart, and R.E.Sheriff, Applied geophysics, Cambridge Univ. Press 1990. 4. M.B.Dobrin, and C.H. Savit, Introduction to geophysical prospecting, McGraw Hill, 1988. 5. E. S. Robinson and C. Coruh, Basic Exploration Geophysics, John Wiley and Sons, New York, 1988.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9005, "Department": "Earth Sciences", "Code": "GP 516", "Title": "Petroleum Geology and Petrophysics", "TotalCredits": "6", "Description": "Introduction to Petroleum geology, Physical and chemical properties of petroleum, subsurface environment, generation and migration of petroleum, traps and seals, sedimentary basins, assessment of basin reserves and global reserves, Introduction to Petrophysics, rock fluid system and interaction, reservoir characteristics, relationship between porosity, permeability and texture, forward modeling and prediction of effects of porosity, lithology and fluids on seismic attributes, Correlation of well log parameters with seismic properties, bulk properties and pore fluid conditions.", "Prerequisite": "Nil", "TextReference": "1. R.C.Selley, Elements of petroleum geology, Academic press, 1997. 2. D.Tiab and E.C.Donaldson, Petrophysics: Theory and Practice of measuring reservoir rock and fluid transport properties, Gulf Professional publishers, 2003. 3. J. Gluyas, R.E. Swarbrick, Petroleum Geoscience, Blackwell Science, 2003. 4. G. Mavko, T. Mukerjee and J. Dvorkin, The Rock Physics handbook: Tools for seismic analysis of porous media, Cambridge, 1998. 5. J.R. Fanchi, Principles of applied reservoir simulation, Gulf Publishing, 1997.", "LastUpdate": "19-06-2009", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9006, "Department": "Earth Sciences", "Code": "GP 518", "Title": "Process Geomorphology, Remote Sensing and GIS", "TotalCredits": "6", "Description": "Geomorphic principles and processes, pedogenesis and morphogenetic regions. Concept of cycle of erosion; fluvial, aeolian, coastal, karst and glacial landscapes, methods of analysis of landforms, slopes and drainage. Aplications of geomorphology. Fundamental concepts of remote sensing; electromagnetic energy and its interactions in the atmosphere and with terrain features; elements of photographic systems, aerial photointerpretation and geological applications, Fundamentals of photogrammetry, satellite remote sensing, multi-spectral scanners, thermal scanners, microwave remote sensing, fundamentals of image interpretation and geological applications, Introduction to digital image processing. Introduction to Geographic Information System, spatial data models and data structures, visualization and query of spatial data, overlay analysis, geological applications of GIS.", "Prerequisite": null, "TextReference": "1. Thornbury, W.D. Principles of Geomorphology, Wiley Eastern, 1993. 2. Holmes, A. Physical Geology, Nelson, 1965. 3. Sabnis, F.F. Remote sensing - Principles and Interpretation, W.H. Freeman and Co., 1978. 4. Lillesand, T.M. and Kiefer, R.W. Remote sensing and Image Interpretation, John Wiley, 1987. 5. Pandey, S.N. Principles and Applications of Photogeology, Wiley Eastern, 1987. 6. Bonham Carter, G.F. GIS for Geoscientists- Modelling with GIS, Elsevier, 1994.", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9007, "Department": "Earth Sciences", "Code": "GS 318", "Title": "Applied Geology for Civil Engineers", "TotalCredits": "6", "Description": "Classification of rock forming minerals and rocks; Igneous rocks, types, characters and properties; Metamorphism and its types, structures, textures and effect on practical properties; Sedimentary environment, structure, textural classification of silici-clastic and carbonate rocks; Weathering process, transportation and sedimentation process; Geological action – wind, water, ocean, glaciers ( landforms); Seismic zones of India; Earth structure- Fold, Fault, Joints and Shear zones; Geological and Geophysical investigations for site classification; Concept of stresses and strain in rocks; Different failure criteria in rocks and rock masses; Engineering properties and strength of rocks; Rock mass classification (RQD, RMR, GSI,RMi); Rock breakage mechanism and safety of civil structures; Geological consideration for the design of Dams, tunnels, bridges and other civil works; Slope stability and stabilization methods; Case studies Practical classes: Identification of common minerals and rock specimens; Measurement of shear strength of rocks; Determination of compressive and tensile strengths of rocks using UTM; Calculation of the deformability characteristic of rocks (elastic, bulk, shear modulus and Poisson’s ratio); Estimation of index properties of rocks (point load strength, slake durability, sonic wave velocity and specific gravity)", "Prerequisite": null, "TextReference": "1. Parthasarathy, A., Panchapakesan, V. and Nagarajan, R. \"Engineering Geology\", Wiley India Pvt Ltd., 2013. ISBN-13: 9788126541829 2. Reddy, D. V. \"Engineering Geology\", Vikas Publishing House, 2010. ISBN13: 9788125919032 3. Goodman, R. E. \"Introduction to Rock Mechanics\", Wiley India Pvt Ltd, 1989. ISBN10: 8126525665 4. Bieniawski, Z. T. \"Engineering Rock Mass Classifications: A Complete Manual for Engineers and Geologists in Mining, Civil, and Petroleum Engineering\", Wiley-Blackwell, 1989. ISBN-10: 0471601721 5. Goel, R. and Singh, B. \"Engineering Rock Mass Classification: Tunneling, Foundations and Landslides\", Elsevier, 2011. ISBN-10: 012385878X 6. Krynine, D.P. and Judd, W.R. \"Principles of Engineering Geology and Geotechnics\", CBS Publishers & Distributors, New Delhi, 1957. ISBN-10: 812390603X", "LastUpdate": "06-04-2015", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9008, "Department": "Earth Sciences", "Code": "GS 413", "Title": "Structural Geology Lab", "TotalCredits": "3", "Description": "Stereographic plotting and contouring of planes and lines. Analysis of folds, faults and ductile shear zone. Strain measurements from deformed fossils and other markers. Interpretation of geological maps. Computer aids to analysis of structural data.", "Prerequisite": null, "TextReference": "Rowland, S.M. and Duebendorfer, E.M. Structural Analysis and Synthesis, Pergamon, 1994. D M Ragan Structural geology - An Introduction to Geometrical Techniques, John Wiley, 1985. Turner, F.J. and Weiss, L.E. Structural Analysis of Metamorphic Tectonites, Mc Graw Hill, 1963. Paor, D. Structural Geology and Personal Computer, Pergamon, 1996.", "LastUpdate": "19-06-2009", "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "2", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9009, "Department": "Earth Sciences", "Code": "GS 416", "Title": "Petrology Lab", "TotalCredits": "6", "Description": "Study of textures and mineral compositions of igneous, sedimentary and metamorphic rocks, their identification and classification. Modal analysis of rocks, study of size, shape, roundness, packing and orientation of grains. CIPW norms, Niggli values, variation diagrams. ACF, AKF and AFM diagrams.", "Prerequisite": null, "TextReference": "Williams, H., Turner, F.J. and Gilbert, C.M. Petrography- An Introduction to the Study of Rocks in Thin Sections, W.H.Freeman and Company, 1954. Kerr, P.F. Optical Mineralogy, McGraw-Hill Book Company, Inc., 1959", "LastUpdate": "19-06-2009", "Structure": {"Type": "L", "Lecture": "2", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9010, "Department": "Earth Sciences", "Code": "GS 519", "Title": "Ore Petrography Lab", "TotalCredits": "3", "Description": "Study of optical properties of ore minerals under incident light microscope. Preparation of samples. Determination of VHN and reflectivity. Systematic study of ore minerals. Study of ore textures. Fluid inclusion petrography, heating and freezing studies.", "Prerequisite": null, "TextReference": "Ineson, P.R. Introduction to Practical Ore Microscopy, Longman Publishers, 1989. Picot, P. and Johan, Z. Atlas of Ore Minerals, Elsevier Publishers, 1982. Craig, J.R. and Vaughan, D.J., Ore Microscopy and Ore Petrology, John Wiley, 1994.", "LastUpdate": "19-06-2009", "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "3", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9011, "Department": "Earth Sciences", "Code": "GS 541", "Title": "Analytical Geochemistry Lab", "TotalCredits": "3", "Description": "Chemical analysis of rocks and minerals, digestion techniques, preparation of standards, estimation of major oxide percentages using spectrophotometric / flame photometric and titrimetric methods. Preparation of calibration curves. Gravimetric estimation of silica and R2O3. Determination of U and The using nuclear techniques. Introduction to Neutron Activation Analysis, principles of ICP analysis", "Prerequisite": null, "TextReference": "Shapiro, L. and Brannock, W.W. Rapid Analysis of Silicate, 1956 Carbonate and Phosphate Rocks, US Geological Survey Bulletin, 1144A, 1975. Jeffrey, P.G. Chemical methods of rock analysis, Pergamon Press, 1970", "LastUpdate": null, "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 9012, "Department": "Earth Sciences", "Code": "GS 815", "Title": "Sedimentary Environments and Facies", "TotalCredits": "6", "Description": "x", "Prerequisite": "nil", "TextReference": "x", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10001, "Department": "Electrical Engineering", "Code": "EE 112", "Title": "Introduction to Electronics", "TotalCredits": "6", "Description": null, "Prerequisite": "Nil", "TextReference": null, "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10002, "Department": "Electrical Engineering", "Code": "EE 114", "Title": "Power Engineering", "TotalCredits": "6", "Description": "      Single phase AC systems: introduction to real/reactive/apparent powers, power factor, introduction to phasors, phasor analysis and phasor diagram Three phase AC systems: analysis of balanced and unbalanced networks Review of magnetic circuits: inductance, mmf, reluctance, mutual inductance Transformers: single phase transformer (equivalent circuit, efficiency, OC/SC tests), auto transformer, three phase connections DC machines: equivalent circuit, separately excited machines Induction machines: rotating magnetic field, equivalent circuit, torque speed characteristics, efficiency, generator/motor action", "Prerequisite": "0.0", "TextReference": "1. Fitzgerald, Arthur Eugene, Charles Kingsley, Stephen D. Umans, and B. James. Electric machinery. Vol. 5. New York: McGraw-Hill, 2003. 2. Nilsson, James W., and Susan Riedel. Electric circuits. Prentice Hall, 2014.", "LastUpdate": "13-11-2019", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10003, "Department": "Electrical Engineering", "Code": "EE 214", "Title": "Digital Circuits Lab", "TotalCredits": "3", "Description": "(To Supplement EE-206)", "Prerequisite": null, "TextReference": null, "LastUpdate": "29-12-2004", "Structure": {"Type": "L", "Lecture": "3", "Tutorial": "0", "Practical": "3", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10004, "Department": "Electrical Engineering", "Code": "EE 221", "Title": "Digital Electronics", "TotalCredits": "6", "Description": "Introduction to Boolean Algebra and Switching Functions, Boolean Minimization, Finite State Machines, Design of synchronous FSMs, FSM Minimization, Asynchronous FSMs. Bipolar Logic Families (TTL + ECL), MOS logic families (NMOS and CMOS), and their electrical behaviour. Memory Elements, Timing circuits, Elementary combinational and sequential digital circuits: adders, comparators, shift registers, counters. Logic Implementation using Programmable Devices (ROM,PLA,FPGA).", "Prerequisite": null, "TextReference": "1. H. Taub and D. Schilling, Digital Integrated Electronics, McGraw Hill, 1977. 2. D.A. Hodges and H.G. Jackson, Analysis and Design of Digital Integrated Circuits, International Student Edition, McGraw Hill 1983. 3. F.J. Hill and G.L. Peterson, Switching Theory and Logic Design, John Wiley, 1981. 4. Z. Kohavi, Switching and Finite Automata Theory, McGraw Hill,1970.", "LastUpdate": "06-07-2012", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10005, "Department": "Electrical Engineering", "Code": "EE 614", "Title": "Solid State Microwave Devices and their Applications", "TotalCredits": "6", "Description": "Amplifiers - Power gain equations, stability, impedance matching, constant gain and noise figure circles. Small signal, low noise, high-power and broadband amplifier design. Oscillators - One port, two port, YIG dielectric and Gunn-diode oscillators. PIN diodes and uses as switches, phase shifters and limiters, varactor diodes, IMPATT and TRAPATT devices, transferred electron devices, Microwave BJTs. GaAs FETs, low noise and power GaAs FETs and their applications, Microwave Mixers.", "Prerequisite": null, "TextReference": "H.A. Watson, Microwave semiconductor devices and their circuit applications, McGraw Hill, 1969. S.Y. Liao, Microwave circuit analysis and amplifier design, Prentice Hall, 1987. G.D. Vendelin, A.M. Pavio, U.L. Rohde, Microwave circuit design, using linear and non-linear techniques, John Wiley, 1990. Y. Konishi, Microwave Integrated Circuits, Marcel Dekker, 1991.", "LastUpdate": "12-12-2003", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10006, "Department": "Electrical Engineering", "Code": "EE 616", "Title": "Electronic Systems Design", "TotalCredits": "6", "Description": "Signal conditioning, Instrumentation & Isolation amplifiers, Analog filters, Analog switches, Programmable circuits, Switched-capacitors circuits and applications. A/D and D/A conversion: sampling and quantization, antialiasing and smoothening filters, Data converters, Interfacing with DSP blocks. Signal measurement in the presence of noise: synchronous detection, signal averaging. Noise in electronic systems; design of low noise circuits. Interfacing of analog and digital systems. PCB design and layout; System assembly considerations.", "Prerequisite": "nil", "TextReference": "1. A. S Sedra and KC Smith, Microelectronic circuits, Oxford, 1998. 2. S. Soclof, Applications of analog integrated circuits, Prentice Hall1990. 3. T. T. Lang, Electronics of measuring systems - practical implementation, Wiley,1987. 4. P. Horowitz and W Hill, The art of electronics, Cambridge,1995. 5. H.W.Ott, Noise Reduction Techniques in Electronic Systems, Wiley, 1989. 6. S. K Mitra, Digital signal processing: a computer based approach, McGraw Hill, 1998. 7. W.C. Bosshart, Printed Circuit Boards: Design and Technlogy, Tata McGraw Hill, 1983. 8. G.L. Ginsberg, Printed Circuit Design, McGraw Hill, 1991.", "LastUpdate": "03-04-2003", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "2", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10007, "Department": "Electrical Engineering", "Code": "EE 619", "Title": "Radio Frequency Microelectronics Chip Design", "TotalCredits": "6", "Description": "Introduction to RF and Wireless Technology: Complexity, design and applications. Choice of Technology. Basic concepts in RF Design: Nonlinearly and Time Variance, intersymbol Interference, random processes and Noise. Definitions of sensitivity and dynamic range, conversion Gains and Distortion. Analog and Digital Modulation for RF circuits: Comparison of various techniques for power efficiency. Coherent and Non coherent defection. Mobile RF Communication systems and basics of Multiple Access techniques. Receiver and Transmitter Architectures and Testing heterodyne, Homodyne, Image-reject, Direct-IF and sub-sampled receivers. Direct Conversion and two steps transmitters. BJT and MOSFET behavior at RF frequencies Modeling of the transistors and SPICE models. Noise performance and limitation of devices. Integrated Parasitic elements at high frequencies and their monolithic implementation. Basic blocks in RF systems and their VLSI implementation : Low Noise Amplifiers design in various technologies, Design of Mixers at GHz frequency range. Various Mixers, their working and implementations, Oscillators: Basic topologies VCO and definition of phase noise. Noise-Power trade-off. Resonatorless VCO design. Quadrature and single-sideband generators, Radio Frequency Synthesizes: PLLS, Various RF synthesizer architectures and frequency dividers, Power Amplifiers design. Linearisation techniques, Design issues in integrated RF filters. Some discussion on available CAD tools for RF VLSI designs.", "Prerequisite": "EE 671", "TextReference": "? B.Razavi, RF Microelectronics, Prentice-Hall PTR,1998 ? T.H.Lee, The Design of CMOS Radio-Frequency Integrated Circuits\", Cambridge University Press, 1998. ? R.Jacob Baker,H.W.Li, and D.E. Boyce, CMOS Circuit Design ,Layout and Simulation, Prentice-Hall of India,1998. ? Y.P. Tsividis Mixed Analog and Digital VLSI Devices and Technology, McGraw Hill,1996", "LastUpdate": "03-04-2003", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10008, "Department": "Electrical Engineering", "Code": "EE 621", "Title": "Markov Chains and Queuing Systems", "TotalCredits": "6", "Description": "{Background:} Markov Chains and regenerative processes have been extensively used in modeling a wide variety of systems and phenomena. Likewise, many systems can be modeled as queueing systems with some aspect of the queue governed by a random process. Obvious examples of such systems occur in telecommunication systems, manufacturing systems and computer systems. This course is aimed at teaching system modeling using Markov chains with special emphasis on developing queueing models. The course contents are as follows. Introduction: Review of basic probability, properties of nonnegative random variables, laws of large numbers and the Central Limit Theorem Renewal Processes: Basic definitions, recurrence times, rewards and renewal reward theorem, point processes, Poisson process, Walds equation, Blackwell`s theorem Discrete time Markov chains: definitions and properties, matrix representation, Perron-Frobenius theory Continuous time Markov chains: basic definitions, $Q-$matrix, birth-death processes, quasi birth death processes. Embedded Markov processes, semi Markov processes, reversible Markov chains Random walks Fundamental queueing results: Little`s theorem, invariance of the mean delay, Conservation law Markovian queues: Jackson and BCMP networks, numerical algorithms M/G/1 & G/M/1 queues and G/G/1 queues Advanced queueing models: priority, vacation and retrials in queues.", "Prerequisite": "Backgr", "TextReference": "? R.~ Wolff, Stochastic Modeling and the Theory Queues, Prentice Hall, Englewood Cliffs, 1989. ? P. Bremaud, Markov Chains, Springer-Verlag, 1999. ? E. Seneta, Non Negative Matrices and Markov Chains, Springer Series in Statistics, Springer, New York, 1981. ? R. Gallager, Discrete Stochastic Processes, Kluwer, Academic Press, 1996. ? L. Kleinrock, Queueing Systems vols I and II, John Wiley and Sons 1976.", "LastUpdate": "03-04-2003", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10009, "Department": "Electrical Engineering", "Code": "EE 651", "Title": "Digital Protection of Power Systems", "TotalCredits": "6", "Description": "Review of principles of power system protection: over-current, directional, differential and distance protection. Teactance, impedences and mho relays, numerical relays:motivation, basic hardware. Review of digital signal processing techniques: sampling, aliasing, courier, discrete Fourier transforms and fast fourier transforms. Numerical algorithms, CT/PT modelling and standard, simulation of transients, electromagnetic transient program(EMTP)", "Prerequisite": null, "TextReference": "J.L. Blackburn, Protective Relaying : Principles and Applications, Marcel Dekker, New York, 1987. A.G. Phadke and J.S.THorp, Computer Relaying for power Systems, John Wiley & Sons, New York,1988.", "LastUpdate": "03-04-2003", "Structure": {"Type": "T", "Lecture": "1", "Tutorial": "2", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10010, "Department": "Electrical Engineering", "Code": "EE 701", "Title": "Introduction to MEMS", "TotalCredits": "6", "Description": "Historical Background: Silicon Pressure sensors, Micromachining, MicroElectroMechanical Systems. Microfabrication and Micromachining : Integrated Circuit Processes, Bulk Micromachining : Isotropic Etching and Anisotropic Etching, Wafer Bonding, High Aspect-Ratio Processes (LIGA) Physical Microsensors: Classification of physical sensors, Integrated, Intelligent, or Smart sensors, Sensor Principles and Examples: Thermal sensors, Electrical Sensors, Mechanical Sensors, Chemical and Biosensors. Microactuators: Electromagnetic and Thermal microactuation, Mechanical design of microactuators, Microactuator examples, microvalves, micropumps, micromotors Microactuator systems : Success Stories, Ink-Jet printer heads, Micro-mirror TV Projector. Surface Micromaching : One or two sacrificial layer processes, Surface micromachining requirements, Polysilicon surface micromachining, Other compatible materials, Silicon Dioxide, Silicon, Micromotors, Gear trains, Mechanisms. Application Areas: All- mechanical miniature devices, 3-D electromagnetic actuators and sensors, RF/Electronics devices, Optical/Photonic devices, Mecical devices e.g DNA chip, micro-arrays. Lab/Design: (two groups will work on one of the following design project as a part of the course) RF/Electronics device/system, Optical/Photonic device/system, Medical device e.g. DNA-chip, micro-arrays.", "Prerequisite": "Nil", "TextReference": "? Stephen D. Senturia, Microsystem Design, Kluwer Academic Publishers, 2001. ? Marc Madou, Fundamentals of Microfabrication, CRC Press, 1997. ? Gregory Kovacs, Micromachined Transducers Sourcebook, WCB McGraw-Hill, Boston, 1998. ? M-H. Bao, Elsevier, Micromechanical Transducers: Pressure sensors, accelerometers, and gyroscopes, New York, 2000.", "LastUpdate": "12-12-2003", "Structure": {"Type": "T", "Lecture": "6", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10011, "Department": "Electrical Engineering", "Code": "EE 719", "Title": "Mixed-Signal VLSI Design", "TotalCredits": "6", "Description": "Sampling theory and discrete-time signals Switch design and switched capacitor circuits Comparators Basics of data converters Nyquist rate ADC’s: Parallel (single-step converters), algorithmic (multi-step converters) and pipelines ADC’s Architectures and design of Nyquist rate ADC’s Nyquist rate DACS’s Architectures and design of Nyquist rate DAC’s High resolution data converters ( data converters) Mixed-signal layout design Integrated power management units (Bulk Converter and LDO) Selected topics in mixed-signal VLSI circuits", "Prerequisite": "0", "TextReference": "1) Design of Analog CMOS Integrated Circuits by Behzad Razavi, McGraw-Hill, Second Edition, 2017. 2) Power Management Techniques for Integrated Circuit Design by Ke-Horg Chen, Wiley-IEEE Press, 2016. 3) Analog Integrated Circuit Design by T. Chan Carusone, David. A. Johns and Ken Martin, John Wiley & Sons, 2012. 4) Advanced data converters by Gabriele Manganaro, Cambridge University Press, 2012 5) Understanding Delta-Sigma Data Converters, Wiley-IEEE Press, R. Schreier, G. Temes, 2004 6) Research Papers.", "LastUpdate": "08-05-2019", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 10012, "Department": "Electrical Engineering", "Code": "EE 791", "Title": "Power Electronic Converters for Renewable Energy", "TotalCredits": "6", "Description": "Introduction to renewable sources: world energy scenario, Wind, solar, hydro, geothermal, availability and power extraction. Introduction to solar energy: Photovoltaic effect, basics of power generation, P-V & I-V characteristics, effect of insolation, temperature, diurnal variation, shading; Modules, connections, ratings; Power extraction (MPP), tracking and MPPT schemes; standalone systems, grid interface, storage, AC-DC loads. Power converters for solar: Micro converter, DC-DC buck/boost/buck-boost /flyback /forward/cuk, bidirectional converters; Inverters: 1ph, 3ph inverters with & w/o x’mer, Heric, H6, Multilevel Neutral point clamp, Modular multilevel, CSI; Control schemes: unipolar, bipolar, PLL and synchronization, power balancing / bypass, Parallel power processing; Grid connection issues: leakage current, Islanding, harmonics, active/reactive power feeding, unbalance. Intro to wind energy: P-V, I-V characteristic, wind power system: turbine-generator-inverter, mechanical control, ratings; Power extraction (MPP) and MPPT schemes. Generators for wind: DC generator with DC to AC converters; Induction generator with & w/o converter; Synchronous generator with back to back controlled/ uncontrolled converter; Doubly fed induction generator with rotor side converter topologies; permanent magnet based generators. Battery: Types, charging discharging. Introduction to AC and DC microgrids. viii", "Prerequisite": null, "TextReference": "[1] Sudipta Chakraborty, Marcelo G. Simões, and William E. Kramer. Power Electronics for Renewable and Distributed Energy Systems: A Sourcebook of Topologies, Control and Integration. Springer Science & Business, 2013. [2] Nicola Femia, Giovanni Petrone, Giovanni Spagnuolo, Massimo Vitelli, Power Electronics and control for maximum Energy Harvesting in Photovoltaic Systems,CRC Press,2013. [3] Chetan Singh Solanki, Solar Photovoltaics: fundamentals, Technologies and Applications, Prentice Hall of India, 2011. [4] N. Mohan, T.M. Undeland & W.P. Robbins, Power Electronics: Converter, Applications & Design, John Wiley & Sons, 1989 [5] Muhammad H. Rashid, Power Electronics: Circuits, Devices, and Applications, Pearson Education India, 2004 [6] E. Guba, P. Sanchis, A. Ursa, J. Lpez, and L. Marroyo, “Ground currents in single-phase transformerless photovoltaic systems,” Progress in Photovoltaics: Research and Applications, vol. 15, no. 7, pp. 629–650, 2007. [7] Remus Teodorescu, Marco Liserre, Pedro Rodriguez, Grid Converters for Photovoltaic and Wind Power Systems, John Wiley and Sons, Ltd., 2011. [8] Ali Keyhani, Design of Smart Power Grid Renewable Energy Systems, Wiley-IEEE Press, 2011. ix", "LastUpdate": "13-11-2014", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11001, "Department": "Energy Science and Engineering", "Code": "EN 110", "Title": "Energy Engineering Fundamentals", "TotalCredits": "6", "Description": "Objective: To provide an idea of the challenges in the field of energy engineering, to provide a perspective on energy technology, systems Dimensions of the energy problem, Historical perspective on energy technology and system development. This will be illustrated by examples of technology development for power generation, transportation and a few application sectors (lighting). Power generation – Wind mills, water wheels for shaft work, Industrial revolution – steam engine and coal fired boilers, Edison’s invention of electricity, Thermal power plant, Electricity generator, electric motor, Economics of scale, super-critical power plants, Distributed generation. Measures of performance and comparison of efficiency and costs for these technologies. Transportation – Bullock car, bicycle, IC engine, Ford T, modern efficient IC engine, electric vehicle, fuel cell vehicle future car concepts – solar car, ethanol cars, lighting – candle kerosene lamp, incandescescent lamp, fluorescent lamps, solid state lighting, Design criteria, Material selection, Reasons for emergence of new technology, Identification of features propelling new developments, constraints imposed by fundamental basis, scarcity of energy resources and materials, Environmental constraints Identification of trends Use of sensors and instrumentation to quantify performance of energy devices (Laboratory sessions). Apart from the technologies analysed, students will be encouraged to identify the challenges in a different energy application (cooling, heating, powering laptops, …..) and proposing innovative solutions or developing small prototypes in the course project. The course will revise basic laws of thermodynamics and economics and use them in the analysis", "Prerequisite": null, "TextReference": "Bejan, Advanced Engineering Thermodynamics , John Wiley, New York, 1988. J. M. Fowler, Energy and the Environment, McGraw Hill, 2nd Edn, New York,1984. T. B. Johannson, H. Kelly, A. K. N. Reddy and R. H. Williams (Ed), Renewable Energy: sources for fuel and electricity, Island Press, Washington DC, 1993.", "LastUpdate": "22-02-2016", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11002, "Department": "Energy Science and Engineering", "Code": "EN 212", "Title": "Electrical Machines", "TotalCredits": "6", "Description": "Magnetic circuits, mutually coupled circuits, Transformers: Principle of operation, equivalent circuit, phasor diagrams, testing , parallel operation and analysis of single phase, three phase transformers and auto transformers. Principle of operation characteristics and control of DC, single phase and three phase induction machines and synchronous machines. Starting techniques of induction motors. Introduction to stepper motors, brushless DC machines, permanent magnetic machines, energy efficient machines.", "Prerequisite": null, "TextReference": "P.C Sen , Principle of electric machines, John Wiley & Sons, New Delhi, 2007. A. E. Fitzgerald, Charles Kingsley, S. D. Umans, Electric Machinery, TMH, New Delhi, 2009.", "LastUpdate": "22-02-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11003, "Department": "Energy Science and Engineering", "Code": "EN 214", "Title": "Transport Phenomena", "TotalCredits": "8", "Description": "Vectors and Tensors – an Introduction; Viscosity and the mechanism of momentum transport, Velocity profile in laminar flow; The equations of change for isothermal systems; Thermal conductivity and the mechanism of energy transport; Temperature distribution in solids and laminar flow; Equations of change for non-isothermal systems; Diffusivity and the mechanism of mass transport; Concentration distribution in solids and in laminar flow, Equations of change for multi-component Systems", "Prerequisite": null, "TextReference": "Transport Phenomena; R. B. Bird, W. E. Stewart and E. N. Lightfoot; John Wiley & Sons; 1960 Introduction to Fluid Mechanics; R. W. Fox and A. T. McDonald; 7th Edition, Wiley Student Edition Fundamentals of Heat and Mass Transfer; F. P. Incropera, D. P. Dewitt, T. L. Berhman and A. S. Lavine; 6th Edition, Wiley India Heat and Mass Transfer: A Transport Phenomena Approch; K S Gandhi; New Age International Publishers", "LastUpdate": "22-02-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11004, "Department": "Energy Science and Engineering", "Code": "EN 216", "Title": "Renewable Energy Technologies", "TotalCredits": "6", "Description": "Introduction to world energy scenario, Renewable energy resources, Radiation, Solar Geometry, radiation models; Solar Thermal, Optical efficiency, thermal efficiency, concentrators, testing procedures, introduction to thermal systems (flat plate collector),solar architecture, solar still, air heater, panel systems; Photovoltaic; Introduction to semiconductor physics, doping, P_N junction, Solar cell and its I_V characteristics, PV systems components, design of a solar PV systems. Biomass, Biomass resources, wood composition, pyrolysis, gasifies, biogas, biodisel, ethanol; Wind, Introduction, types of wind machines, Cp-λ curve & betz limits, wind recourse analysis; Systems, stand alone, grid connected, hybrid, system design; Hydro systems, Hydro resources, types of hydro turbine, small hydro systems; Other systems, Geothermal, wave energy, ocean energy", "Prerequisite": null, "TextReference": "S. P. Sukhatme, Solar Energy - Principles of thermal collection and storage, second edition, Tata McGraw-Hill, New Delhi, 1996 J. A. Duffie and W. A. Beckman, Solar Engineering of Thermal Processes, second edition, John Wiley, New York, 1991 D. Y. Goswami, F. Kreith and J. F. Kreider, Principles of Solar Engineering, Taylor and Francis, Philadelphia, 2000 D. D. Hall and R. P. Grover, Biomass Regenerable Energy, John Wiley, New York, 1987. J. Twidell and T. Weir, Renewable Energy Resources, E & F N Spon Ltd, London, 1986. M. A. Green, Solar Cells, Prentice-Hall, Englewood Cliffs, 1982.", "LastUpdate": "22-02-2016", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11005, "Department": "Energy Science and Engineering", "Code": "EN 218", "Title": "Energy Resources, Economics & Environment", "TotalCredits": "6", "Description": "Overview of World Energy Scenario, Dis-aggregation by end-use, by supply Fossil Fuel Reserves - Estimates, Duration Overview of India`s Energy Scenario - Dis-aggregation by end-use, by supply, reserves Country Energy Balance Construction - Examples Trends in energy use patterns, energy and development linkage. Energy Economics – Simple Payback Period, Time Value of Money, IRR, NPV, Life Cycle Costing, Cost of Saved Energy , Cost of Energy generated, Examples from energy generation and conservation, Energy Chain, Primary energy analysis Life Cycle Assessment, Net Energy Analysis Environmental Impacts of energy use - Air Pollution SOx, NOx, CO, particulates Solid and Water Pollution, Formation of pollutants, measurement and controls; sources of emissions, effect of operating and design parameters on emission, control methods, Exhaust emission test, procedures, standards and legislation; environmental audits; Emission factors and inventories Global Warming, CO2 Emissions, Impacts, Mitigation Sustainability, Externalities, Future Energy Systems.", "Prerequisite": null, "TextReference": "Energy and the Challenge of Sustainability, World energy assessment, UNDP, New York, 2000. A.K.N. Reddy, RH Williams, TB Johansson, Energy after Rio, Prospects and challenges, UNDP, United Nations Publications, New York, 1997. Global energy perspectives / edited by Nebojsa Nakicenovic, Arnulf Grubler and Alan McDonald, Cambridge University Press, 1998 J.M. Fowler, Energy and the environment,. 2nd Ed. ,McGraw Hill, New York, 1984", "LastUpdate": "22-02-2016", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11006, "Department": "Energy Science and Engineering", "Code": "EN 301", "Title": "Introduction to Renewable Energy Technologies", "TotalCredits": "6", "Description": "Introduction to world energy scenario, Renewable energy resources, Radiation, Solar Geometry, radiation models; Solar Thermal, Optical efficiency, thermal efficiency, concentrators, testing procedures, introduction to thermal systems (flat plate collector), solar architecture, solar still, air heater, panel systems; Photovoltaic; Introduction to semiconductor physics, doping, P_N junction, Solar cell and its I_V characteristics, PV systems components, design of a solar PV systems. Biomass, Biomass resources, wood composition, pyrolysis, gasifies, biogas, biodisel, ethanol; Wind, Introduction, types of wind machines, Cp-l curve & betz limits, wind recourse analysis; Systems, stand alone, grid connected, hybrid, system design; Hydro systems, Hydro resources, types of hydro turbine, small hydro systems; Other systems, Geothermal, wave energy, ocean energy", "Prerequisite": null, "TextReference": "S. P. Sukhatme, Solar Energy - Principles of thermal collection and storage, second edition, Tata McGraw-Hill, New Delhi, 1996 J. A. Duffie and W. A. Beckman, Solar Engineering of Thermal Processes, second edition, John Wiley, New York, 1991 D. Y. Goswami, F. Kreith and J. F. Kreider, Principles of Solar Engineering, Taylor and Francis, Philadelphia, 2000 D. D. Hall and R. P. Grover, Biomass Regenerable Energy, John Wiley, New York, 1987. J. Twidell and T. Weir, Renewable Energy Resources, E & F N Spon Ltd, London, 1986. M. A. Green, Solar Cells, Prentice-Hall, Englewood Cliffs, 1982.", "LastUpdate": "06-07-2012", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "1", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11007, "Department": "Energy Science and Engineering", "Code": "EN 310", "Title": "IC Engine and Combustion Lab", "TotalCredits": "4", "Description": "The laboratory exercise will mainly aim at introducing the determination of fuel properties relevant to their combustion and design of combustion equipments. This will include the properties like calorific value, proximate analysis, viscosity, surface tension, density, flash point, carbon residue (for liquid fuels) and determination of Flame velocity for gaseous fuels. The basic understanding of IC engines, their parts and its working will be shown. The testing and performance evaluation of engine will also be included", "Prerequisite": null, "TextReference": null, "LastUpdate": "22-02-2016", "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "4", "Practical": "0.5", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11008, "Department": "Energy Science and Engineering", "Code": "EN 312", "Title": "Control & Instrumentation", "TotalCredits": "8", "Description": "Dynamics of physical systems, notion of feed-back; open- and closed-loop systems. Laplace transforms and Z-transforms; application of transforms to discrete and continuous systems-analysis; industrial control examples. Transfer function models of mechanical, electrical, thermal and hydraulic systems, closed-loop systems. Block diagram and signal flow graph analysis. Basic modes of feedback control: proportional, integral and derivative. Stability concept, stability criterion. Root locus method of design lead and leg compensation. Relationship between time & frequency response, polar plots, Bode’s plots. Stability in frequency domain, Nyquist plots and criterion. Frequency-domain methods of design, Compensation and their realization in time and frequency domain. Lead and Lag compensation. Instrumentation systems for physical measurements: Measurement and control of displacement, strain, force, torque acceleration, temperature and flow. Acquisition systems: data loggers, pc based data acquisition systems, interfacing and bus standards. Introduction to distributed control systems (DCS): programmable logic controller and their industrial applications.", "Prerequisite": null, "TextReference": "M. Gopal, I.J. Nagrath, Control Systems Engineering 5th Edition, New Age International, 2011. Benjamin C Kuo, Automatic Control Systems 7th Edition, PHI Learning, 1995. William C. Dunn, Fundamentals of Industrial Instrumentation and Process Control 1st Edition, Tata Mcgraw Hill Education, 2009 Norman A. Anderson, Instrumentation for Process Measurement and Control 3rd Edition, Publisher: CRC Press, 1997", "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "1", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11009, "Department": "Energy Science and Engineering", "Code": "EN 314", "Title": "Electrochemistry", "TotalCredits": "6", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11010, "Department": "Energy Science and Engineering", "Code": "EN 321", "Title": "Supervised Learning Project", "TotalCredits": "6", "Description": "- Equipment / prototype - design / development /fabrication /testing. - Algorithm / software / model - design / development - On field survey - design / implementation - Experimental research - Design an Experiment", "Prerequisite": null, "TextReference": "Each student will have reading that are specific to his/her project.", "LastUpdate": "22-09-2017", "Structure": {"Type": "L", "Lecture": "0", "Tutorial": "0", "Practical": "6", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11011, "Department": "Energy Science and Engineering", "Code": "EN 410", "Title": "Energy Management", "TotalCredits": "6", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": null, "Structure": {"Type": "T", "Lecture": "0", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11012, "Department": "Energy Science and Engineering", "Code": "EN 412", "Title": "Thermodynamics and Statistical Mechanics", "TotalCredits": "6", "Description": "Basic Concepts and Laws of Thermodynamics; Concept of Equilibrium; Simple System and Formal Relations (Euler/ Gibb’s Duhem) and its Applications to Various Systems; Legendre Transformation and Free Energy; Extremum Principle; Thermodynamic Potentials; Maxwell’s Relations; Stability and Phase Transition. Fundamental Postulates of Statistical Mechanics; Macro Canonical Ensembles; Statistical Mechanics Applications; Partition functions - Gas and Liquid State; Phase Transformations; Critical Phenomena", "Prerequisite": null, "TextReference": "Statistical Mechanics, K. Huang, John Wiley, 2 Edition, (1987). Statistical Mechanics, R. K. Pathria, Butterworth Heinemann, 2nd Edition, (1996). Heat and Thermodynamics, M.W. Zemansky and R. H. Dittman, McGraw Hill, 7 th Edition, (1997). Thermodynamics and an Introduction to Thermostatistics, H. B. Callen, John Wiley, 2 nd Edition, (1985). Elements of Thermodynamics, D. ter Haar and Harald Wergeland, Addison-Wesley, (1966). Phase Transition and Critical Phenomenon, H. E. Stanley, Cambridge University Press, (1988). Fundamentals of Statistical and Thermal Physics, F. Reif (International Student Edition) McGraw Hill (1985). Statistical Mechanics (Part I and II), L. D. Landau and E. M. Lifshitz, (1980).", "LastUpdate": "26-04-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11013, "Department": "Energy Science and Engineering", "Code": "EN 414", "Title": "Methods in Analytical Techniques", "TotalCredits": "8", "Description": "Structural: X-ray Diffraction (XRD); Scanning Electron Microscopy (SEM); Transmission Electron Microscopy (TEM); Electron diffraction analysis Electronic Structure: X-ray Photoelectron Spectroscopy (XPS); X-ray Absorption Spectroscopy (XAS); Photoluminescence (PL) Molecular Structure: Infrared (IR); Fourier Transform IR (FTIR); and Raman Spectroscopy Composition Analysis:Energy Dispersive X-ray (EDX); Auger Electron Spectroscopy (AES); and Secondary Ion Mass Spectrometry (SIMS) SurfaceMorphology: Scanning Tunneling Microscopy (STM); Atomic Force Microscopy (AFM); Optical: UV-Vis.", "Prerequisite": null, "TextReference": "Physical Methods, R.S. Drago, Saunders College Publishing, 2nd Edition, (1992). Microanalysis of Solids, B.G. Yacobi, D.B. Holt and L.L. Kazmerski, Plenum Press, (1994). Elements of X-Ray Diffraction, B.D. Cullity, S.R. Stock, Addision_Wesley Metallurgy Series, 3rd Ed., 2001. Electron microscopy and Analysis, P.J. Goodhew, F.J. Humphreys, R. Beanland, Taylor and Francis, 2001. Transmission Electron Microscopy, Volumes 1-4, Kluwer Academic/ Plenum Publishers, D.B. Williams, C. B. Carter, 2nd Ed., 2009. Scanning Electron Microscopy and X-ray Microanalysis, J. Goldstein, D.E. Newbury, D.C. Joy, C.E. Lyman, P. Echlin, E. Lifshin, L. Sawyer, J.R. Michael,Springer, 3rd Ed., 2003. Spin Dynamics: Basics of Nuclear Magnetic Resonance, M.H. Levitt, Wiley, 2nd Ed., 2008. Fundamentals of Fourier Transform Infrared Spectroscopy”, B.C. Smith, CRC Press, 2nd Ed., 2011.", "LastUpdate": "26-04-2016", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "4", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11014, "Department": "Energy Science and Engineering", "Code": "EN 415", "Title": "Energy Laboratory I", "TotalCredits": "6", "Description": "This laboratory is intended to provide an exposure to energy research. This is structured in the form of 7-8 discrete modules. Each module would consist of a lecture, a tutorial and an experiment. Each module will be handled by a separate faculty member and will be based on their ongoing research. Examples of the modules: (a) Electrofabrication of Nanomaterials for Hydrogen Storage: The experiment would involve electrodeposition of magnesium and physical characterisation. (b) Hydrogen Storage Characteristics of Hydrides: Experiments using Sieverts apparatus, Pressure composition temperature characteristics, Vant Hoff plot, reversibility and kinetics. (c) Synthesis of Cu2O by Electrodepostion and Thermal Annealing: Study optical and electrical characteristics. (d) Infrared Thermography for Energy Application. (e) Electrocatalysts for Fuel Cells: Experiments will involve fabrication of electrocatalysts and physical and electrochemical characterisation. The students would go through individual modules in groups of 2-3. Each group would also be required to carry out/design an open ended experiment based on one of the modules of their choice.", "Prerequisite": null, "TextReference": "Notes will be provided", "LastUpdate": "26-04-2016", "Structure": {"Type": "L", "Lecture": "1", "Tutorial": "0", "Practical": "4", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11015, "Department": "Energy Science and Engineering", "Code": "EN 417", "Title": "Computer Programming", "TotalCredits": "6", "Description": null, "Prerequisite": null, "TextReference": null, "LastUpdate": "26-04-2016", "Structure": {"Type": "T", "Lecture": "2", "Tutorial": "0", "Practical": "2", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11016, "Department": "Energy Science and Engineering", "Code": "EN 418", "Title": "Introduction to Transport Phenomena", "TotalCredits": "6", "Description": "Vectors and Tensors - an Introduction; Viscosity and the Mechanism of Momentum Transport; Velocity Distribution in Laminar Flow; The Equations of Change for Isothermal Systems; Thermal Conductivity and the Mechanism of Energy Transport; Temperature Distribution in Solids and Laminar Flow; Equations of Change for Non-Isothermal Systems; Diffusivity and the Mechanism of Mass Transport; Concentration Distribution in Solids and in Laminar Flow; Equations of Change for Multi-Component Systems.", "Prerequisite": null, "TextReference": "Transport Phenomena, R.B. Bird, W.E. Stewart and E.N. Lightfoot, Wiley-Eastern, New Delhi, (l960). The Properties of Gases and Liquids, R.C. Reid, J.M. Prausnitz and B.E. Poling, McGraw Hill International, 4 th Edition, New Delhi, (1988).", "LastUpdate": "26-04-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11017, "Department": "Energy Science and Engineering", "Code": "EN 610", "Title": "Hydrogen Energy", "TotalCredits": "6", "Description": "Hydrogen Production – Production of hydrogen from hydrocarbons –Oxidative and non-oxidative processes, coal. H2 production using nuclear energy and renewables- wind, biomass, solar. Hydrogen separation and purification – Pressure swing adsorption; Solvent based absorption, membrane separation, cryogenic separation etc. Hydrogen storage – compressed storage, liquid state storage, solid state storage, different materials for storage – metal hydrides, high surface area materials, complex and chemical hydrides, hydrogen storage system – design and materials aspects. Hydrogen sensing – Traditional methods of hydrogen sensing using thermal conductivity measurements or GC, MS or laser gas analysis; Solid state sensors- their working principle and applications in industrial scale applications. Hydrogen Safety – History of accident; physiological, physical and chemical hazards; hydrogen properties associated with hazards; Hazard spotting, evaluation and safety guidelines; Hydrogen safety codes and standards.", "Prerequisite": null, "TextReference": "T.Ohta (Ed.), Solar hydrogen Energy System Pergomon Press, 1979. D.A. Maths, Hydorgen Technlogy for Energy, Noyes Data Corpn, 1976. S.S.Pener and L. Iceman, Energy Vol.II. Addison Wesley, 1974.", "LastUpdate": "08-11-2016", "Structure": {"Type": "T", "Lecture": "0", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11018, "Department": "Energy Science and Engineering", "Code": "EN 612", "Title": "Non-conventional Energy Systems Lab.", "TotalCredits": "3", "Description": "Measurement of solar radiation and sunshine hours, Measurement of albedo, UV & IR radiation, Measurement of emissivity, reflectivity, transmittivity, Performance testing of solar flat plate water heater ? forced flow & thermosyphon systems, Performance testing solar air heater & dryer & desalination unit, Performance testing of solar thermal concentrators, Characteristics of photovoltaic devices & testing of solar PV operated pump, Energy consumption & lumen measurement of lights & ballasts.", "Prerequisite": "0", "TextReference": null, "LastUpdate": "03-04-2003", "Structure": {"Type": "L", "Lecture": "3", "Tutorial": "0", "Practical": "3", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11019, "Department": "Energy Science and Engineering", "Code": "EN 661", "Title": "Micro and Nanoscale Energy Transport", "TotalCredits": "6", "Description": "ontinuum laws and limitations ; Energy carriers at micro/nanoscale and their attributes; Engineering applications, Size effects 2. Energy states Schrodinger equation; Energy states of quantum wells, harmonic oscillators, rigid rotors, hydrogen atoms, electrons and phonons in crystals; Applicability in nanoscale devices such as quantum dot lasers, superlattices and photonic crystals 3. Energy storage Density of states; Ensembles; molecular partition functions; specific heat of gases; Fermi-Dirac and Bose Einstein distributions; Specific heat of phonons and electrons 4. Energy transport Energy transport by waves: plane electron waves and reflection, electromagnetic waves and reflection at single interface, interference and tunneling, acoustic waves; Energy transport by particles: Wave to particle transition, Boltzmann equation, scattering mechanisms and relaxation time approximation, Derivation of continuum laws including Fourier law, Newton’s shear stress law, Ohm’s law from the Boltzmann equation Transport by liquid: Derivation of Navier Stokes equation for gas molecules, Single phase liquid flow and heat transport in microtubes and channels; Two-phase heat transfer in microchannels; 5. Energy conversion: Nonequilibrium between different heat carriers, nonequilibrium between electrons and phonons in laser-materials interaction, Hot and cold electron effects in semiconductor devices and thermoelectric devices 6. Simulation and measurement techniques in micro and nanoscale transport processes Introduction to Monte Carlo technique and molecular dynamics ; Scanning thermal microscopy; Optical techniques for local measurements and short-time heat transfer effects", "Prerequisite": null, "TextReference": "1. “Nanoscale energy transport and conversion: a parallel treatment of electrons, molecules, phonons, and photons”, Chen, Gang. Oxford University Press, 2005. 2. “Microscale and nanoscale heat transfer”, Volz, S. and Carminati, R. eds, Springer-Verlag Berlin/Heidelberg, 2007. 3. “Nano/microscale heat transfer”, Zhang, Zhuomin M, New York: McGraw-Hill, 2007. 4.. “Microscale and nanoscale heat transfer: fundamentals and engineering applications.”, Sobhan, Choondal B., and George P. Peterson, CRC Press, 2008.", "LastUpdate": "16-10-2020", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "N"}}, {"id": 11020, "Department": "Energy Science and Engineering", "Code": "ENT210", "Title": "Marketing for Entrepreneurs", "TotalCredits": "3", "Description": " Evolution of marketing management  Role of Marketing within the Startup Framework  Problem identification for Starting Up  Quick & rough Market Research  Customer Segmentation and Focus for Launch  Customer Value proposition & Accelerated Product/Solution design  Lean Marketing Strategy for New Ventures  Early Stage Positioning, Branding & Communicating  New Introductions : Pricing and Commercial Strategy  Managing Marketing Spend and Measuring ROI  Test marketing a New Product / solution  Competitive Defense and Differentiation  Scaling Up Profitably", "Prerequisite": "0.0", "TextReference": " Marketing Management, A South Asian Perspective by Philip Kotler, Kevin Keller, Abraham Koshy and Mitleshwar Jha, 14th Edition, Pearson India, 2012  Art of Social Media by Guy Kawasaki, Portfolio, Mar 2015  Scaling Up Excellence by Hayagreeva Rao, Robert I. Sutton, Random House, 2014", "LastUpdate": "08-11-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}, {"id": 11021, "Department": "Energy Science and Engineering", "Code": "ENT601", "Title": "Intellectual Property for Entrepreneurs", "TotalCredits": "3", "Description": " Introduction to IP Introduction  Patent Fundamentals  Patent Informatics  Copyrights  Designs 302226 All forms of design including graphic and interaction design  Trade Marks, Service Dress, Branding  Trade Secrets and other forms of IP  Industry specific IP issues  IP Management  IP Issues in Agreements", "Prerequisite": "0.0", "TextReference": " Richard Stim, Intellectual Property: Patents, Trademarks and Copyrights, 2 nd Edition Cengage Learning, 2001  Vinod V. Sople, Managing Intellectual Property – A Strategic Imperative,5th Edition, IndiaPrentice Hall Web references : http://www.ircc.iitb.ac.in/IRCC-ebpage/rnd/PDF/Final_IITB_IP_PolicyDocument.pdf http://www.ircc.iitb.ac.in/webnew/ippolicy.html", "LastUpdate": "08-11-2016", "Structure": {"Type": "T", "Lecture": "3", "Tutorial": "0", "Practical": "0", "Selfstudy": "0", "HalfSemester": "Y"}}]